var MongoClient = require('mongodb').MongoClient;
var DB_CONN_STR = 'mongodb://localhost:27017/mydb';// # 数据库为 runoob
 
var insertData = function(db, callback) {  
    //连接到表 site
    var collection = db.collection('newdb');
    //插入数据
    
    collection.insert(data, function(err, result) { 
        if(err)
        {
            console.log('Error:'+ err);
            return;
        }     
        callback(result);
    });
}
 
MongoClient.connect(DB_CONN_STR, function(err, db) {
    console.log("连接成功！");
    insertData(db, function(result) {
        console.log(result);
        db.close();
    });
});

var data = [
  {
    "姓名": "丁瑞圖",
    "出生地": "鹿港",
    "生年": 1894,
    "卒年": 1944
  },
  {
    "姓名": "丁瑞鉠",
    "出生地": "基隆",
    "生年": 1904,
    "卒年": 1987
  },
  {
    "姓名": "李煥美",
    "出生地": "鹿港",
    "生年": 1899,
    "卒年": 1965
  },
  {
    "姓名": "施人豪",
    "出生地": "臺中/臺南",
    "生年": 1937,
    "卒年": 1990
  },
  {
    "姓名": "邱漢水",
    "出生地": "田尾",
    "生年": 1879,
    "卒年": ""
  },
  {
    "姓名": "施興",
    "出生地": "鹿港",
    "生年": 1888,
    "卒年": 1965
  },
  {
    "姓名": "柏高理",
    "出生地": "匈牙利",
    "生年": 1908,
    "卒年": 1991
  },
  {
    "姓名": "柯子元",
    "出生地": "伸港",
    "生年": 1914,
    "卒年": 1988
  },
  {
    "姓名": "柯永昌",
    "出生地": "線西",
    "生年": 1900,
    "卒年": 1946
  },
  {
    "姓名": "柳金木",
    "出生地": "員林",
    "生年": 1910,
    "卒年": 1946
  },
  {
    "姓名": "洪思灣",
    "出生地": "二林",
    "生年": "",
    "卒年": 1875
  },
  {
    "姓名": "洪棟",
    "出生地": "埔鹽",
    "生年": "",
    "卒年": 1795
  },
  {
    "姓名": "洪欽懋",
    "出生地": "二林",
    "生年": 1918,
    "卒年": 1977
  },
  {
    "姓名": "洪彌盾",
    "出生地": "二林",
    "生年": 1862,
    "卒年": 1923
  },
  {
    "姓名": "胡萬立",
    "出生地": "永靖",
    "生年": 1906,
    "卒年": 1992
  },
  {
    "姓名": "唐鋼鋒",
    "出生地": "花壇",
    "生年": 1911,
    "卒年": 1995
  },
  {
    "姓名": "徐成",
    "出生地": "埔心",
    "生年": 1907,
    "卒年": 1956
  },
  {
    "姓名": "殷金錠",
    "出生地": "大城/二林",
    "生年": 1898,
    "卒年": 1978
  },
  {
    "姓名": "涂敏正",
    "出生地": "埔心",
    "生年": 1906,
    "卒年": 1982
  },
  {
    "姓名": "閃佑道",
    "出生地": "西班牙",
    "生年": 1874,
    "卒年": 1951
  },
  {
    "姓名": "高信義",
    "出生地": "彰化",
    "生年": 1942,
    "卒年": 2009
  },
  {
    "姓名": "常圓上人",
    "出生地": "田中",
    "生年": 1922,
    "卒年": 1998
  },
  {
    "姓名": "張在",
    "出生地": "福興",
    "生年": 1874,
    "卒年": 1958
  },
  {
    "姓名": "張協銘",
    "出生地": "北斗",
    "生年": 1909,
    "卒年": 2009
  },
  {
    "姓名": "張協源",
    "出生地": "溪州",
    "生年": 1910,
    "卒年": 1980
  },
  {
    "姓名": "張紹乾",
    "出生地": "員林",
    "生年": 1847,
    "卒年": 1905
  },
  {
    "姓名": "張雲梯",
    "出生地": "芬園",
    "生年": 1897,
    "卒年": 1968
  },
  {
    "姓名": "張灥生",
    "出生地": "彰化",
    "生年": 1889,
    "卒年": 1968
  },
  {
    "姓名": "梅鑑霧",
    "出生地": "蘇格蘭",
    "生年": 1865,
    "卒年": 1940
  },
  {
    "姓名": "淺井初子",
    "出生地": "日本熊本縣",
    "生年": 1910,
    "卒年": 1940
  },
  {
    "姓名": "粘錫麟",
    "出生地": "福興",
    "生年": 1939,
    "卒年": 2013
  },
  {
    "姓名": "許丁綿",
    "出生地": "北斗",
    "生年": 1861,
    "卒年": 1941
  },
  {
    "姓名": "許乃邦",
    "出生地": "彰化",
    "生年": 1908,
    "卒年": 1999
  },
  {
    "姓名": "許定田",
    "出生地": "溪州/北斗",
    "生年": 1866,
    "卒年": 1937
  },
  {
    "姓名": "許天賜",
    "出生地": "北斗/溪州",
    "生年": 1906,
    "卒年": 1982
  },
  {
    "姓名": "許石頭",
    "出生地": "員林",
    "生年": 1901,
    "卒年": 1976
  },
  {
    "姓名": "許再枝",
    "出生地": "埔心",
    "生年": 1921,
    "卒年": 2016
  },
  {
    "姓名": "許克綏",
    "出生地": "臺中",
    "生年": 1892,
    "卒年": 1983
  },
  {
    "姓名": "許林",
    "出生地": "員林",
    "生年": 1877,
    "卒年": 1932
  },
  {
    "姓名": "許屋",
    "出生地": "田中",
    "生年": 1890,
    "卒年": 1959
  },
  {
    "姓名": "許秦",
    "出生地": "二林",
    "生年": 1891,
    "卒年": 1964
  },
  {
    "姓名": "許書劍",
    "出生地": "線西",
    "生年": 1921,
    "卒年": 2012
  },
  {
    "姓名": "許喬木",
    "出生地": "大城",
    "生年": 1918,
    "卒年": 2008
  },
  {
    "姓名": "許肇清",
    "出生地": "鹿港",
    "生年": 1856,
    "卒年": 1900
  },
  {
    "姓名": "許學",
    "出生地": "竹塘",
    "生年": 1892,
    "卒年": 1951
  },
  {
    "姓名": "許讀",
    "出生地": "鹿港",
    "生年": 1901,
    "卒年": 1994
  },
  {
    "姓名": "連瑪玉",
    "出生地": "英格蘭",
    "生年": 1884,
    "卒年": 1984
  },
  {
    "姓名": "小林正之介",
    "出生地": "日本茨城縣",
    "生年": 1884,
    "卒年": ""
  },
  {
    "姓名": "尤水永",
    "出生地": "和美",
    "生年": 1919,
    "卒年": 2013
  },
  {
    "姓名": "楊桂森",
    "出生地": "雲南石屏州",
    "生年": "",
    "卒年": ""
  },
  {
    "姓名": "楊滄浪",
    "出生地": "溪湖",
    "生年": 1895,
    "卒年": 1982
  },
  {
    "姓名": "楊萬上",
    "出生地": "北斗",
    "生年": 1898,
    "卒年": 1981
  },
  {
    "姓名": "楊維堯",
    "出生地": "溪湖",
    "生年": 1905,
    "卒年": 1965
  },
  {
    "姓名": "葉惠清",
    "出生地": "溪州",
    "生年": 1868,
    "卒年": 1928
  },
  {
    "姓名": "葉啟仁",
    "出生地": "溪州",
    "生年": 1904,
    "卒年": 1985
  },
  {
    "姓名": "詹奕候",
    "出生地": "竹塘",
    "生年": 1902,
    "卒年": 1941
  },
  {
    "姓名": "廖發明",
    "出生地": "竹塘",
    "生年": 1902,
    "卒年": 1946
  },
  {
    "姓名": "廖樹生",
    "出生地": "溪州",
    "生年": 1874,
    "卒年": 1948
  },
  {
    "姓名": "劉西江",
    "出生地": "溪州",
    "生年": 1903,
    "卒年": 1982
  },
  {
    "姓名": "劉崧袖",
    "出生地": "大城",
    "生年": 1901,
    "卒年": 1968
  },
  {
    "姓名": "潘邦治",
    "出生地": "福興",
    "生年": 1863,
    "卒年": 1939
  },
  {
    "姓名": "蔡天開",
    "出生地": "二水",
    "生年": 1890,
    "卒年": 1979
  },
  {
    "姓名": "蔡世文",
    "出生地": "溪湖",
    "生年": 1835,
    "卒年": 1909
  },
  {
    "姓名": "蔡孝乾",
    "出生地": "中國",
    "生年": 1903,
    "卒年": 1982
  },
  {
    "姓名": "蔡河清",
    "出生地": "溪湖",
    "生年": 1876,
    "卒年": 1931
  },
  {
    "姓名": "蔡淵騰",
    "出生地": "二林",
    "生年": 1896,
    "卒年": 1971
  },
  {
    "姓名": "蔡博",
    "出生地": "埔心",
    "生年": 1883,
    "卒年": 1943
  },
  {
    "姓名": "蔡懋棠",
    "出生地": "鹿港",
    "生年": 1923,
    "卒年": 1978
  },
  {
    "姓名": "鄭家吉",
    "出生地": "田尾",
    "生年": 1942,
    "卒年": 2005
  },
  {
    "姓名": "鄭添益",
    "出生地": "溪州",
    "生年": 1898,
    "卒年": 1971
  },
  {
    "姓名": "盧兆麟",
    "出生地": "彰化",
    "生年": 1929,
    "卒年": 2008
  },
  {
    "姓名": "蕭貞吉",
    "出生地": "社頭",
    "生年": 1831,
    "卒年": 1911
  },
  {
    "姓名": "蕭敦仁",
    "出生地": "田中",
    "生年": 1890,
    "卒年": 1972
  },
  {
    "姓名": "蕭朝金",
    "出生地": "社頭",
    "生年": 1908,
    "卒年": 1947
  },
  {
    "姓名": "蕭載福",
    "出生地": "社頭",
    "生年": 1830,
    "卒年": 1936
  },
  {
    "姓名": "蕭潭",
    "出生地": "社頭",
    "生年": 1896,
    "卒年": 1969
  },
  {
    "姓名": "蕭錫齡",
    "出生地": "社頭",
    "生年": 1925,
    "卒年": 2006
  },
  {
    "姓名": "蕭鴻",
    "出生地": "田中",
    "生年": 1900,
    "卒年": 1989
  },
  {
    "姓名": "賴通堯",
    "出生地": "彰化",
    "生年": 1906,
    "卒年": 1989
  },
  {
    "姓名": "賴維烜",
    "出生地": "大村",
    "生年": 1913,
    "卒年": 1958
  },
  {
    "姓名": "賴游豆",
    "出生地": "大村",
    "生年": 1913,
    "卒年": 2013
  },
  {
    "姓名": "賴頭",
    "出生地": "大村",
    "生年": 1889,
    "卒年": 1945
  },
  {
    "姓名": "賴維種",
    "出生地": "大村",
    "生年": 1903,
    "卒年": 1961
  },
  {
    "姓名": "謝克昌",
    "出生地": "福興",
    "生年": 1914,
    "卒年": 1957
  },
  {
    "姓名": "謝言信",
    "出生地": "溪州",
    "生年": 1929,
    "卒年": 2010
  },
  {
    "姓名": "謝東閔",
    "出生地": "二水",
    "生年": 1908,
    "卒年": 2001
  },
  {
    "姓名": "謝春木",
    "出生地": "中國",
    "生年": 1902,
    "卒年": 1969
  },
  {
    "姓名": "謝彪",
    "出生地": "芳苑",
    "生年": 1891,
    "卒年": 1978
  },
  {
    "姓名": "謝許英",
    "出生地": "北斗",
    "生年": 1920,
    "卒年": 1993
  },
  {
    "姓名": "謝雪紅",
    "出生地": "中國",
    "生年": 1901,
    "卒年": 1970
  },
  {
    "姓名": "謝報",
    "出生地": "二水",
    "生年": 1915,
    "卒年": 1997
  },
  {
    "姓名": "謝銀來",
    "出生地": "福興",
    "生年": 1902,
    "卒年": 1995
  },
  {
    "姓名": "蘇子蘅",
    "出生地": "中國",
    "生年": 1905,
    "卒年": 1996
  },
  {
    "姓名": "蘇振輝",
    "出生地": "彰化",
    "生年": 1907,
    "卒年": 1997
  },
  {
    "姓名": "王金海",
    "出生地": "彰化",
    "生年": 1895,
    "卒年": 1966
  },
  {
    "姓名": "平井幸三郎",
    "出生地": "日本熊本縣",
    "生年": 1873,
    "卒年": ""
  },
  {
    "姓名": "田路市郎治",
    "出生地": "日本兵庫縣",
    "生年": 1882,
    "卒年": ""
  },
  {
    "姓名": "江河",
    "出生地": "員林",
    "生年": 1907,
    "卒年": 1995
  },
  {
    "姓名": "江秋陽",
    "出生地": "員林",
    "生年": 1880,
    "卒年": 1946
  },
  {
    "姓名": "連藤",
    "出生地": "竹塘",
    "生年": 1885,
    "卒年": 1955
  },
  {
    "姓名": "郭火炎",
    "出生地": "臺北",
    "生年": 1903,
    "卒年": 1965
  },
  {
    "姓名": "郭佳信",
    "出生地": "美國紐約市",
    "生年": 1931,
    "卒年": 2015
  },
  {
    "姓名": "郭松根",
    "出生地": "鹿港",
    "生年": 1903,
    "卒年": 1982
  },
  {
    "姓名": "郭春槐",
    "出生地": "員林",
    "生年": 1918,
    "卒年": 1983
  },
  {
    "姓名": "郭發",
    "出生地": "彰化",
    "生年": 1900,
    "卒年": ""
  },
  {
    "姓名": "野口牛之輔",
    "出生地": "日本佐賀縣",
    "生年": 1884,
    "卒年": ""
  },
  {
    "姓名": "陳大福",
    "出生地": "二林",
    "生年": 1902,
    "卒年": 1984
  },
  {
    "姓名": "陳作舟",
    "出生地": "北斗",
    "生年": 1833,
    "卒年": 1895
  },
  {
    "姓名": "陳以傳",
    "出生地": "北斗",
    "生年": 1876,
    "卒年": 1942
  },
  {
    "姓名": "陳廷鐐",
    "出生地": "北斗",
    "生年": 1917,
    "卒年": 1988
  },
  {
    "姓名": "陳元英",
    "出生地": "永靖",
    "生年": 1817,
    "卒年": 1887
  },
  {
    "姓名": "陳儀亭",
    "出生地": "永靖",
    "生年": 1863,
    "卒年": 1937
  },
  {
    "姓名": "陳光妙",
    "出生地": "溪湖",
    "生年": 1824,
    "卒年": 1895
  },
  {
    "姓名": "陳如",
    "出生地": "二水",
    "生年": 1894,
    "卒年": 1976
  },
  {
    "姓名": "陳有光",
    "出生地": "永靖",
    "生年": 1850,
    "卒年": 1909
  },
  {
    "姓名": "陳百川",
    "出生地": "鹿港",
    "生年": 1897,
    "卒年": 1987
  },
  {
    "姓名": "陳弄",
    "出生地": "埤頭",
    "生年": "",
    "卒年": 1864
  },
  {
    "姓名": "陳周全",
    "出生地": "溪湖",
    "生年": "",
    "卒年": 1795
  },
  {
    "姓名": "陳祈",
    "出生地": "鹿港",
    "生年": 1842,
    "卒年": 1893
  },
  {
    "姓名": "陳固",
    "出生地": "花壇",
    "生年": 1893,
    "卒年": 1978
  },
  {
    "姓名": "陳?",
    "出生地": "霧峰",
    "生年": 1875,
    "卒年": 1939
  },
  {
    "姓名": "陳松江",
    "出生地": "田中",
    "生年": 1922,
    "卒年": 2011
  },
  {
    "姓名": "陳林翠娥",
    "出生地": "永靖",
    "生年": 1904,
    "卒年": 1998
  },
  {
    "姓名": "陳招春",
    "出生地": "社頭",
    "生年": 1904,
    "卒年": 1980
  },
  {
    "姓名": "陳炳文",
    "出生地": "二水",
    "生年": 1874,
    "卒年": 1966
  },
  {
    "姓名": "陳炳靈",
    "出生地": "田尾",
    "生年": 1889,
    "卒年": 1970
  },
  {
    "姓名": "陳崁",
    "出生地": "彰化",
    "生年": 1900,
    "卒年": 1972
  },
  {
    "姓名": "陳捷魁",
    "出生地": "花壇",
    "生年": "",
    "卒年": ""
  },
  {
    "姓名": "陳添愿",
    "出生地": "芳苑",
    "生年": 1853,
    "卒年": 1908
  },
  {
    "姓名": "陳章哲",
    "出生地": "社頭",
    "生年": 1883,
    "卒年": 1976
  },
  {
    "姓名": "陳景崧",
    "出生地": "田中",
    "生年": 1903,
    "卒年": 1999
  },
  {
    "姓名": "陳傳繼",
    "出生地": "秀水",
    "生年": 1907,
    "卒年": 1987
  },
  {
    "姓名": "陳萬居",
    "出生地": "溪湖",
    "生年": 1904,
    "卒年": 1974
  },
  {
    "姓名": "陳翠玉",
    "出生地": "和美",
    "生年": 1917,
    "卒年": 1988
  },
  {
    "姓名": "傅仲周",
    "出生地": "埤頭",
    "生年": 1887,
    "卒年": 1955
  },
  {
    "姓名": "善光上人",
    "出生地": "員林",
    "生年": 1920,
    "卒年": 1973
  },
  {
    "姓名": "彭林換",
    "出生地": "田尾",
    "生年": 1874,
    "卒年": 1950
  },
  {
    "姓名": "彭懷德",
    "出生地": "田尾",
    "生年": 1910,
    "卒年": 1995
  },
  {
    "姓名": "斌宗法師",
    "出生地": "鹿港",
    "生年": 1911,
    "卒年": 1958
  },
  {
    "姓名": "曾玉音",
    "出生地": "彰化",
    "生年": 1744,
    "卒年": 1827
  },
  {
    "姓名": "曾拔萃",
    "出生地": "員林",
    "生年": "",
    "卒年": ""
  },
  {
    "姓名": "曾春泉",
    "出生地": "員林",
    "生年": 1895,
    "卒年": 1970
  },
  {
    "姓名": "曾炳元",
    "出生地": "田中",
    "生年": 1886,
    "卒年": 1964
  },
  {
    "姓名": "曾黃杏",
    "出生地": "竹塘",
    "生年": 1871,
    "卒年": 1930
  },
  {
    "姓名": "游高岩",
    "出生地": "彰化",
    "生年": 1911,
    "卒年": 2005
  },
  {
    "姓名": "辜本",
    "出生地": "鹿港",
    "生年": 1898,
    "卒年": 1969
  },
  {
    "姓名": "黃文陶",
    "出生地": "彰化",
    "生年": 1893,
    "卒年": 1970
  },
  {
    "姓名": "黃呈聰",
    "出生地": "線西",
    "生年": 1886,
    "卒年": 1963
  },
  {
    "姓名": "陳培甲",
    "出生地": "秀水",
    "生年": 1855,
    "卒年": 1908
  },
  {
    "姓名": "陳彩灼",
    "出生地": "北斗",
    "生年": 1905,
    "卒年": 1985
  },
  {
    "姓名": "陳捷鰲",
    "出生地": "永靖",
    "生年": 1894,
    "卒年": 1948
  },
  {
    "姓名": "陳作忠",
    "出生地": "永靖",
    "生年": 1902,
    "卒年": 1979
  },
  {
    "姓名": "陳章琪",
    "出生地": "北斗",
    "生年": 1880,
    "卒年": 1941
  },
  {
    "姓名": "陳紹輝",
    "出生地": "田尾",
    "生年": 1942,
    "卒年": 2012
  },
  {
    "姓名": "陳筆",
    "出生地": "彰化",
    "生年": 1908,
    "卒年": 2000
  },
  {
    "姓名": "陳義",
    "出生地": "芳苑",
    "生年": 1880,
    "卒年": 1959
  },
  {
    "姓名": "陳福胤",
    "出生地": "永靖",
    "生年": 1890,
    "卒年": 1976
  },
  {
    "姓名": "陳慶全",
    "出生地": "二水",
    "生年": 1910,
    "卒年": 2000
  },
  {
    "姓名": "陳質芬",
    "出生地": "鹿港",
    "生年": 1873,
    "卒年": 1926
  },
  {
    "姓名": "陳勳",
    "出生地": "二林",
    "生年": 1902,
    "卒年": 1964
  },
  {
    "姓名": "陳篡地",
    "出生地": "二水",
    "生年": 1907,
    "卒年": 1986
  },
  {
    "姓名": "陳錫卿",
    "出生地": "彰化",
    "生年": 1907,
    "卒年": 1985
  },
  {
    "姓名": "陳懷澄",
    "出生地": "鹿港",
    "生年": 1877,
    "卒年": 1940
  },
  {
    "姓名": "陳培煦",
    "出生地": "鹿港",
    "生年": 1900,
    "卒年": 1969
  },
  {
    "姓名": "陳幼石",
    "出生地": "鹿港",
    "生年": 1928,
    "卒年": 1999
  },
  {
    "姓名": "陳鐘英",
    "出生地": "二水",
    "生年": 1902,
    "卒年": 1976
  },
  {
    "姓名": "陳馨",
    "出生地": "埔鹽",
    "生年": 1917,
    "卒年": 1990
  },
  {
    "姓名": "陳讓",
    "出生地": "花壇",
    "生年": "",
    "卒年": 1901
  },
  {
    "姓名": "彭如勳",
    "出生地": "田尾",
    "生年": 1909,
    "卒年": 1968
  },
  {
    "姓名": "曾曰瑛",
    "出生地": "江西南昌",
    "生年": 1708,
    "卒年": 1753
  },
  {
    "姓名": "游水盛",
    "出生地": "大村",
    "生年": 1888,
    "卒年": 1937
  },
  {
    "姓名": "游漢枝",
    "出生地": "大村",
    "生年": 1916,
    "卒年": 1994
  },
  {
    "姓名": "游蘇鴦",
    "出生地": "彰化",
    "生年": 1895,
    "卒年": 1988
  },
  {
    "姓名": "程守傳",
    "出生地": "中國",
    "生年": 1906,
    "卒年": 1946
  },
  {
    "姓名": "辜顯榮",
    "出生地": "臺北",
    "生年": 1866,
    "卒年": 1937
  },
  {
    "姓名": "辜振甫",
    "出生地": "臺北",
    "生年": 1917,
    "卒年": 2005
  },
  {
    "姓名": "黃天",
    "出生地": "溪州",
    "生年": 1908,
    "卒年": 1950
  },
  {
    "姓名": "黃石柱",
    "出生地": "花壇",
    "生年": 1922,
    "卒年": 1980
  },
  {
    "姓名": "黃合益",
    "出生地": "大村",
    "生年": 1900,
    "卒年": 1974
  },
  {
    "姓名": "黃呈木",
    "出生地": "埤頭",
    "生年": 1910,
    "卒年": 1986
  },
  {
    "姓名": "黃秀傳",
    "出生地": "線西",
    "生年": 1897,
    "卒年": 1976
  },
  {
    "姓名": "黃枝楠",
    "出生地": "埤頭",
    "生年": 1912,
    "卒年": 1977
  },
  {
    "姓名": "黃致中",
    "出生地": "田尾",
    "生年": 1869,
    "卒年": 1929
  },
  {
    "姓名": "黃家守",
    "出生地": "埔心",
    "生年": 1873,
    "卒年": 1942
  },
  {
    "姓名": "黃振三",
    "出生地": "田尾",
    "生年": 1913,
    "卒年": 1993
  },
  {
    "姓名": "黃高碧桃",
    "出生地": "彰化",
    "生年": 1902,
    "卒年": 1970
  },
  {
    "姓名": "黃紹啟",
    "出生地": "花壇",
    "生年": 1927,
    "卒年": 2013
  },
  {
    "姓名": "黃尊秋",
    "出生地": "臺北",
    "生年": 1923,
    "卒年": 2000
  },
  {
    "姓名": "黃順興",
    "出生地": "臺東/中國",
    "生年": 1923,
    "卒年": 2002
  },
  {
    "姓名": "黃獅保",
    "出生地": "埔心",
    "生年": 1905,
    "卒年": 1974
  },
  {
    "姓名": "黃澄清",
    "出生地": "花壇",
    "生年": 1914,
    "卒年": 1965
  },
  {
    "姓名": "黃文堯",
    "出生地": "花壇",
    "生年": 1935,
    "卒年": 2014
  },
  {
    "姓名": "楊玉麟",
    "出生地": "二林",
    "生年": 1911,
    "卒年": 1988
  },
  {
    "姓名": "楊吉臣",
    "出生地": "彰化",
    "生年": 1854,
    "卒年": 1930
  },
  {
    "姓名": "楊克煌",
    "出生地": "中國",
    "生年": 1908,
    "卒年": 1978
  },
  {
    "姓名": "楊灶",
    "出生地": "溪湖",
    "生年": 1919,
    "卒年": 1999
  },
  {
    "姓名": "楊宗喜",
    "出生地": "溪湖",
    "生年": 1926,
    "卒年": 2006
  },
  {
    "姓名": "黃況",
    "出生地": "線西",
    "生年": 1895,
    "卒年": 1979
  },
  {
    "姓名": "黃長庚",
    "出生地": "埤頭",
    "生年": 1918,
    "卒年": 1980
  },
  {
    "姓名": "黃美玉",
    "出生地": "員林",
    "生年": 1889,
    "卒年": 1963
  },
  {
    "姓名": "黃時先",
    "出生地": "秀水",
    "生年": 1862,
    "卒年": 1940
  },
  {
    "姓名": "黃滄浪",
    "出生地": "埤頭",
    "生年": 1916,
    "卒年": 1986
  },
  {
    "姓名": "黃彰輝",
    "出生地": "彰化",
    "生年": 1914,
    "卒年": 1988
  },
  {
    "姓名": "黃禮永",
    "出生地": "鹿港",
    "生年": 1864,
    "卒年": 1930
  },
  {
    "姓名": "黃耀南",
    "出生地": "埔心",
    "生年": 1871,
    "卒年": 1934
  },
  {
    "姓名": "黃騰標",
    "出生地": "彰化",
    "生年": 1931,
    "卒年": 2004
  },
  {
    "姓名": "楊水心",
    "出生地": "霧峰",
    "生年": 1882,
    "卒年": 1957
  },
  {
    "姓名": "楊老居",
    "出生地": "彰化",
    "生年": 1899,
    "卒年": 1978
  },
  {
    "姓名": "楊紅綢",
    "出生地": "彰化",
    "生年": 1911,
    "卒年": 1995
  },
  {
    "姓名": "楊志雄",
    "出生地": "溪湖",
    "生年": 1909,
    "卒年": 1966
  },
  {
    "姓名": "楊振文",
    "出生地": "溪湖",
    "生年": "",
    "卒年": ""
  },
  {
    "姓名": "楊應選",
    "出生地": "彰化",
    "生年": "",
    "卒年": ""
  },
  {
    "姓名": "楊啟元",
    "出生地": "北斗",
    "生年": 1768,
    "卒年": ""
  },
  {
    "姓名": "楊清標",
    "出生地": "員林",
    "生年": 1910,
    "卒年": 2004
  },
  {
    "姓名": "楊傳枝",
    "出生地": "芬園",
    "生年": 1903,
    "卒年": 1973
  },
  {
    "姓名": "楊瑤麟",
    "出生地": "溪湖",
    "生年": 1913,
    "卒年": 1995
  },
  {
    "姓名": "楊維新",
    "出生地": "溪湖",
    "生年": 1902,
    "卒年": 1988
  },
  {
    "姓名": "楊慶南",
    "出生地": "溪湖",
    "生年": 1950,
    "卒年": 2008
  },
  {
    "姓名": "葉光前",
    "出生地": "員林",
    "生年": 1893,
    "卒年": 1954
  },
  {
    "姓名": "詹澤浩",
    "出生地": "永靖",
    "生年": 1915,
    "卒年": 1982
  },
  {
    "姓名": "達成上人",
    "出生地": "溪湖",
    "生年": 1897,
    "卒年": 1974
  },
  {
    "姓名": "瑪喜樂",
    "出生地": "美國華盛頓州",
    "生年": 1914,
    "卒年": 2007
  },
  {
    "姓名": "劉川在",
    "出生地": "埤頭",
    "生年": 1935,
    "卒年": 2014
  },
  {
    "姓名": "劉存天",
    "出生地": "芳苑",
    "生年": 1888,
    "卒年": 1978
  },
  {
    "姓名": "劉英春",
    "出生地": "芳苑",
    "生年": 1945,
    "卒年": 2007
  },
  {
    "姓名": "劉崧甫",
    "出生地": "大城",
    "生年": 1898,
    "卒年": 1971
  },
  {
    "姓名": "德真和尚尼",
    "出生地": "霧峰/臺中",
    "生年": 1892,
    "卒年": 1991
  },
  {
    "姓名": "德欽和尚尼",
    "出生地": "霧峰/臺中",
    "生年": 1889,
    "卒年": 1971
  },
  {
    "姓名": "蔡文興",
    "出生地": "美國紐約市",
    "生年": 1909,
    "卒年": 1998
  },
  {
    "姓名": "蔡水福",
    "出生地": "二水",
    "生年": 1885,
    "卒年": 1950
  },
  {
    "姓名": "蔡廷元",
    "出生地": "鹿港",
    "生年": "",
    "卒年": ""
  },
  {
    "姓名": "蔡志昌",
    "出生地": "溪湖",
    "生年": 1916,
    "卒年": 2000
  },
  {
    "姓名": "蔡景璋",
    "出生地": "鹿港",
    "生年": 1909,
    "卒年": 2001
  },
  {
    "姓名": "蔡滋浬",
    "出生地": "溪湖",
    "生年": 1917,
    "卒年": 1981
  },
  {
    "姓名": "蔡禎祥",
    "出生地": "溪湖",
    "生年": 1911,
    "卒年": 1974
  },
  {
    "姓名": "蔡標",
    "出生地": "溪湖",
    "生年": 1907,
    "卒年": 1977
  },
  {
    "姓名": "黎安德",
    "出生地": "美國麻薩諸塞州",
    "生年": 1907,
    "卒年": 2008
  },
  {
    "姓名": "鄭鼎",
    "出生地": "二水",
    "生年": 1896,
    "卒年": 1953
  },
  {
    "姓名": "蕭玉衡",
    "出生地": "二林",
    "生年": 1900,
    "卒年": 1990
  },
  {
    "姓名": "蕭再安",
    "出生地": "社頭",
    "生年": 1920,
    "卒年": 1999
  },
  {
    "姓名": "蕭雲章",
    "出生地": "田中",
    "生年": 1901,
    "卒年": 1964
  },
  {
    "姓名": "蕭傳",
    "出生地": "社頭",
    "生年": 1855,
    "卒年": 1923
  },
  {
    "姓名": "蕭碧鳳",
    "出生地": "社頭",
    "生年": 1947,
    "卒年": 1999
  },
  {
    "姓名": "賴萬青",
    "出生地": "大村",
    "生年": 1840,
    "卒年": 1900
  },
  {
    "姓名": "賴冰",
    "出生地": "員林",
    "生年": 1869,
    "卒年": 1915
  },
  {
    "姓名": "賴淵國",
    "出生地": "大村",
    "生年": 1889,
    "卒年": 1915
  },
  {
    "姓名": "賴宜",
    "出生地": "大村",
    "生年": 1868,
    "卒年": 1915
  },
  {
    "姓名": "賴松",
    "出生地": "員林",
    "生年": 1896,
    "卒年": 1972
  },
  {
    "姓名": "賴鳳儀",
    "出生地": "員林",
    "生年": 1904,
    "卒年": 1981
  },
  {
    "姓名": "賴樸園",
    "出生地": "大村",
    "生年": 1745,
    "卒年": 1823
  },
  {
    "姓名": "謝如松",
    "出生地": "員林",
    "生年": 1902,
    "卒年": 1955
  },
  {
    "姓名": "謝洪秀枝",
    "出生地": "員林",
    "生年": 1905,
    "卒年": 1996
  },
  {
    "姓名": "謝成哲",
    "出生地": "和美",
    "生年": 1910,
    "卒年": 1996
  },
  {
    "姓名": "謝宗",
    "出生地": "芳苑",
    "生年": 1899,
    "卒年": 1974
  },
  {
    "姓名": "謝頂",
    "出生地": "田中",
    "生年": 1911,
    "卒年": 1992
  },
  {
    "姓名": "謝緯",
    "出生地": "二林",
    "生年": 1916,
    "卒年": 1970
  },
  {
    "姓名": "謝獻臣",
    "出生地": "花壇",
    "生年": 1924,
    "卒年": 2000
  },
  {
    "姓名": "顏志銘",
    "出生地": "員林",
    "生年": 1950,
    "卒年": 2011
  },
  {
    "姓名": "魏天德",
    "出生地": "永靖",
    "生年": 1899,
    "卒年": 1987
  },
  {
    "姓名": "魏克思",
    "出生地": "美國北卡羅來納州",
    "生年": 1913,
    "卒年": 2001
  },
  {
    "姓名": "羅方",
    "出生地": "美國俄亥俄州",
    "生年": 1925,
    "卒年": 2005
  },
  {
    "姓名": "蘭大衛",
    "出生地": "蘇格蘭",
    "生年": 1870,
    "卒年": 1957
  },
  {
    "姓名": "蘭大弼",
    "出生地": "彰化",
    "生年": 1914,
    "卒年": 2010
  },
  {
    "姓名": "顧合",
    "出生地": "秀水",
    "生年": 1894,
    "卒年": 1955
  },
  {
    "姓名": "丁寶鈞",
    "出生地": "鹿港",
    "生年": 1875,
    "卒年": 1911
  },
  {
    "姓名": "丁瑞魚",
    "出生地": "臺北",
    "生年": 1901,
    "卒年": 1973
  },
  {
    "姓名": "丁韻仙",
    "出生地": "鹿港",
    "生年": 1923,
    "卒年": 2012
  },
  {
    "姓名": "王春興",
    "出生地": "鹿港",
    "生年": 1890,
    "卒年": 1966
  },
  {
    "姓名": "王接傳",
    "出生地": "社頭",
    "生年": 1870,
    "卒年": 1920
  },
  {
    "姓名": "王弼選",
    "出生地": "福建同安",
    "生年": 1784,
    "卒年": 1844
  },
  {
    "姓名": "王銅鐘",
    "出生地": "溪州",
    "生年": 1890,
    "卒年": 1944
  },
  {
    "姓名": "王耀文",
    "出生地": "彰化",
    "生年": 1918,
    "卒年": 2004
  },
  {
    "姓名": "甘文芳",
    "出生地": "彰化",
    "生年": 1901,
    "卒年": 1986
  },
  {
    "姓名": "白雲禪師",
    "出生地": "北京市",
    "生年": 1915,
    "卒年": 2011
  },
  {
    "姓名": "寺田清三郎",
    "出生地": "日本三重縣",
    "生年": 1882,
    "卒年": ""
  },
  {
    "姓名": "江俊傑",
    "出生地": "員林",
    "生年": 1873,
    "卒年": ""
  },
  {
    "姓名": "江傳德",
    "出生地": "員林",
    "生年": 1917,
    "卒年": 1982
  },
  {
    "姓名": "江慶森",
    "出生地": "員林",
    "生年": 1904,
    "卒年": 1967
  },
  {
    "姓名": "吳鴻賓",
    "出生地": "彰化",
    "生年": 1835,
    "卒年": 1893
  },
  {
    "姓名": "吳士禎",
    "出生地": "彰化",
    "生年": 1868,
    "卒年": 1923
  },
  {
    "姓名": "吳秋澤",
    "出生地": "彰化",
    "生年": 1873,
    "卒年": 1945
  },
  {
    "姓名": "吳起材",
    "出生地": "彰化",
    "生年": 1890,
    "卒年": 1940
  },
  {
    "姓名": "李中慶",
    "出生地": "彰化",
    "生年": 1899,
    "卒年": 1961
  },
  {
    "姓名": "李君曜",
    "出生地": "彰化",
    "生年": 1897,
    "卒年": 1971
  },
  {
    "姓名": "李東運",
    "出生地": "花壇",
    "生年": 1929,
    "卒年": 1999
  },
  {
    "姓名": "李金鐘",
    "出生地": "彰化",
    "生年": 1904,
    "卒年": 1974
  },
  {
    "姓名": "李柱",
    "出生地": "田尾",
    "生年": 1904,
    "卒年": 1972
  },
  {
    "姓名": "李振鵬",
    "出生地": "花壇",
    "生年": 1867,
    "卒年": 1948
  },
  {
    "姓名": "李晏",
    "出生地": "彰化",
    "生年": 1896,
    "卒年": 1967
  },
  {
    "姓名": "李清楠",
    "出生地": "福興",
    "生年": 1921,
    "卒年": 2008
  },
  {
    "姓名": "李渡河",
    "出生地": "福建廈門",
    "生年": 1859,
    "卒年": 1919
  },
  {
    "姓名": "李增塹",
    "出生地": "二林",
    "生年": 1880,
    "卒年": 1950
  },
  {
    "姓名": "李德裁",
    "出生地": "花壇",
    "生年": 1823,
    "卒年": 1898
  },
  {
    "姓名": "李篤卿",
    "出生地": "花壇",
    "生年": 1873,
    "卒年": 1929
  },
  {
    "姓名": "李慶樟",
    "出生地": "花壇",
    "生年": 1898,
    "卒年": 1970
  },
  {
    "姓名": "李慶牛",
    "出生地": "花壇",
    "生年": 1906,
    "卒年": 1952
  },
  {
    "姓名": "阮建業",
    "出生地": "和美",
    "生年": 1864,
    "卒年": 1928
  },
  {
    "姓名": "林上洲",
    "出生地": "田尾",
    "生年": 1910,
    "卒年": 2002
  },
  {
    "姓名": "林文濬",
    "出生地": "鹿港",
    "生年": 1757,
    "卒年": 1826
  },
  {
    "姓名": "林文湊",
    "出生地": "鹿港",
    "生年": "",
    "卒年": ""
  },
  {
    "姓名": "林月雲",
    "出生地": "和美",
    "生年": 1915,
    "卒年": 1992
  },
  {
    "姓名": "林玉池",
    "出生地": "員林",
    "生年": 1860,
    "卒年": 1931
  },
  {
    "姓名": "林吳帖",
    "出生地": "霧峰",
    "生年": 1900,
    "卒年": 1972
  },
  {
    "姓名": "林坤元",
    "出生地": "鹿港",
    "生年": 1907,
    "卒年": 1996
  },
  {
    "姓名": "林金岩",
    "出生地": "埔鹽",
    "生年": 1927,
    "卒年": 2008
  },
  {
    "姓名": "林國泰",
    "出生地": "彰化",
    "生年": 1767,
    "卒年": 1822
  },
  {
    "姓名": "林清溪",
    "出生地": "永靖",
    "生年": 1876,
    "卒年": 1943
  },
  {
    "姓名": "林新懇",
    "出生地": "北斗",
    "生年": 1919,
    "卒年": 1958
  },
  {
    "姓名": "林糊",
    "出生地": "員林",
    "生年": 1894,
    "卒年": 1973
  },
  {
    "姓名": "林篤勳",
    "出生地": "彰化",
    "生年": 1882,
    "卒年": 1952
  },
  {
    "姓名": "林錫金",
    "出生地": "鹿港",
    "生年": 1902,
    "卒年": 1985
  },
  {
    "姓名": "林麗明",
    "出生地": "彰化",
    "生年": 1899,
    "卒年": 1984
  },
  {
    "姓名": "邱全壽",
    "出生地": "田尾",
    "生年": 1887,
    "卒年": 1982
  },
  {
    "姓名": "西田與治郎",
    "出生地": "日本福井縣",
    "生年": 1889,
    "卒年": ""
  },
  {
    "姓名": "吳汝祥",
    "出生地": "彰化",
    "生年": 1868,
    "卒年": 1941
  },
  {
    "姓名": "吳洛",
    "出生地": "彰化",
    "生年": "",
    "卒年": ""
  },
  {
    "姓名": "吳家錄",
    "出生地": "臺北",
    "生年": 1928,
    "卒年": 2012
  },
  {
    "姓名": "吳望熊",
    "出生地": "埤頭",
    "生年": 1915,
    "卒年": 1995
  },
  {
    "姓名": "吳新鏡",
    "出生地": "北斗",
    "生年": 1906,
    "卒年": 1990
  },
  {
    "姓名": "吳輝龍",
    "出生地": "大城",
    "生年": 1892,
    "卒年": 1949
  },
  {
    "姓名": "吳聰其",
    "出生地": "伸港",
    "生年": 1930,
    "卒年": 2001
  },
  {
    "姓名": "巫世傳",
    "出生地": "臺北",
    "生年": 1897,
    "卒年": 1965
  },
  {
    "姓名": "巫金山",
    "出生地": "彰化",
    "生年": 1887,
    "卒年": 1949
  },
  {
    "姓名": "李山河",
    "出生地": "花壇",
    "生年": 1900,
    "卒年": 1984
  },
  {
    "姓名": "李丙戌",
    "出生地": "彰化",
    "生年": 1883,
    "卒年": 1957
  },
  {
    "姓名": "李功垂",
    "出生地": "溪湖",
    "生年": 1896,
    "卒年": 1965
  },
  {
    "姓名": "李金火土",
    "出生地": "北斗",
    "生年": 1913,
    "卒年": 1976
  },
  {
    "姓名": "李俊啟",
    "出生地": "員林/臺北",
    "生年": 1883,
    "卒年": 1961
  },
  {
    "姓名": "李俊黨",
    "出生地": "員林",
    "生年": 1885,
    "卒年": 1951
  },
  {
    "姓名": "李姠",
    "出生地": "福興",
    "生年": 1896,
    "卒年": 1979
  },
  {
    "姓名": "李?支",
    "出生地": "鹿港",
    "生年": 1896,
    "卒年": 1972
  },
  {
    "姓名": "李雅歆",
    "出生地": "彰化",
    "生年": 1870,
    "卒年": 1907
  },
  {
    "姓名": "李崇禮",
    "出生地": "彰化",
    "生年": 1874,
    "卒年": 1951
  },
  {
    "姓名": "李君晰",
    "出生地": "彰化",
    "生年": 1906,
    "卒年": 1988
  },
  {
    "姓名": "李矮",
    "出生地": "溪湖",
    "生年": 1904,
    "卒年": 1979
  },
  {
    "姓名": "李鵬儀",
    "出生地": "花壇",
    "生年": 1890,
    "卒年": 1957
  },
  {
    "姓名": "杜錫圭",
    "出生地": "彰化",
    "生年": 1901,
    "卒年": 1985
  },
  {
    "姓名": "卓再枝",
    "出生地": "田中",
    "生年": 1922,
    "卒年": 1999
  },
  {
    "姓名": "周汝東",
    "出生地": "花壇",
    "生年": 1908,
    "卒年": 1982
  },
  {
    "姓名": "松岡富雄",
    "出生地": "日本熊本縣",
    "生年": 1870,
    "卒年": ""
  },
  {
    "姓名": "林生財",
    "出生地": "北斗",
    "生年": 1897,
    "卒年": 1969
  },
  {
    "姓名": "林汝直",
    "出生地": "北斗",
    "生年": 1896,
    "卒年": 1967
  },
  {
    "姓名": "林伯奏",
    "出生地": "北斗/臺北",
    "生年": 1897,
    "卒年": 1992
  },
  {
    "姓名": "林伯楷",
    "出生地": "北斗",
    "生年": 1899,
    "卒年": 1941
  },
  {
    "姓名": "林和忍",
    "出生地": "員林",
    "生年": 1901,
    "卒年": 1961
  },
  {
    "姓名": "林波",
    "出生地": "秀水",
    "生年": 1888,
    "卒年": 1970
  },
  {
    "姓名": "林看",
    "出生地": "埔鹽",
    "生年": 1895,
    "卒年": 1962
  },
  {
    "姓名": "林振嵩",
    "出生地": "鹿港",
    "生年": 1731,
    "卒年": 1798
  },
  {
    "姓名": "林朝廷",
    "出生地": "福興",
    "生年": 1901,
    "卒年": 1995
  },
  {
    "姓名": "林筠奎",
    "出生地": "鹿港",
    "生年": "",
    "卒年": ""
  },
  {
    "姓名": "林榮春",
    "出生地": "彰化",
    "生年": 1909,
    "卒年": 1989
  },
  {
    "姓名": "林鳳山",
    "出生地": "秀水",
    "生年": 1892,
    "卒年": 1973
  },
  {
    "姓名": "林隨",
    "出生地": "秀水",
    "生年": 1882,
    "卒年": 1957
  },
  {
    "姓名": "林爐",
    "出生地": "二林",
    "生年": 1892,
    "卒年": 1951
  },
  {
    "姓名": "林騰輝",
    "出生地": "埤頭",
    "生年": 1940,
    "卒年": 2006
  },
  {
    "姓名": "近藤進之助",
    "出生地": "日本愛知縣",
    "生年": 1887,
    "卒年": ""
  },
  {
    "姓名": "邱添才",
    "出生地": "埔心",
    "生年": 1901,
    "卒年": 1967
  },
  {
    "姓名": "邱傳道",
    "出生地": "永靖",
    "生年": 1889,
    "卒年": 1965
  },
  {
    "姓名": "邱禮逢",
    "出生地": "員林",
    "生年": 1884,
    "卒年": 1966
  },
  {
    "姓名": "邱魏朝興",
    "出生地": "員林",
    "生年": 1864,
    "卒年": 1931
  },
  {
    "姓名": "施木火",
    "出生地": "埔鹽",
    "生年": 1913,
    "卒年": 1985
  },
  {
    "姓名": "施世榜",
    "出生地": "彰化",
    "生年": 1671,
    "卒年": 1743
  },
  {
    "姓名": "丁醴澄",
    "出生地": "鹿港",
    "生年": 1846,
    "卒年": 1886
  },
  {
    "姓名": "丁寶濂",
    "出生地": "鹿港",
    "生年": 1867,
    "卒年": 1929
  },
  {
    "姓名": "丁瑞乾",
    "出生地": "溪湖",
    "生年": 1902,
    "卒年": 1984
  },
  {
    "姓名": "丁玉書",
    "出生地": "鹿港",
    "生年": 1915,
    "卒年": 2007
  },
  {
    "姓名": "丁玉?",
    "出生地": "鹿港",
    "生年": 1921,
    "卒年": 2001
  },
  {
    "姓名": "丁淑卿",
    "出生地": "臺北",
    "生年": 1934,
    "卒年": 1998
  },
  {
    "姓名": "丸山昌信",
    "出生地": "日本新瀉縣",
    "生年": 1897,
    "卒年": ""
  },
  {
    "姓名": "尤世瑞",
    "出生地": "溪湖",
    "生年": 1882,
    "卒年": 1943
  },
  {
    "姓名": "尤增輝",
    "出生地": "鹿港",
    "生年": 1948,
    "卒年": 1980
  },
  {
    "姓名": "牛島啟太",
    "出生地": "日本佐賀縣",
    "生年": 1895,
    "卒年": 1945
  },
  {
    "姓名": "王友芬",
    "出生地": "彰化",
    "生年": 1905,
    "卒年": 1994
  },
  {
    "姓名": "王永成",
    "出生地": "鹿港",
    "生年": 1887,
    "卒年": 1968
  },
  {
    "姓名": "王白淵",
    "出生地": "二水",
    "生年": 1902,
    "卒年": 1965
  },
  {
    "姓名": "王席聘",
    "出生地": "鹿港",
    "生年": 1876,
    "卒年": 1929
  },
  {
    "姓名": "王漢英",
    "出生地": "鹿港",
    "生年": 1915,
    "卒年": 1981
  },
  {
    "姓名": "王重五",
    "出生地": "鹿港",
    "生年": 1917,
    "卒年": 1997
  },
  {
    "姓名": "王桂木",
    "出生地": "彰化",
    "生年": 1913,
    "卒年": 1969
  },
  {
    "姓名": "王崑山",
    "出生地": "鹿港",
    "生年": 1900,
    "卒年": 1994
  },
  {
    "姓名": "王舜年",
    "出生地": "鹿港",
    "生年": 1871,
    "卒年": 1930
  },
  {
    "姓名": "王義貞",
    "出生地": "彰化",
    "生年": 1868,
    "卒年": 1945
  },
  {
    "姓名": "王蘭生",
    "出生地": "彰化",
    "生年": 1891,
    "卒年": 1971
  },
  {
    "姓名": "石原昇",
    "出生地": "日本靜岡縣",
    "生年": 1892,
    "卒年": 1932
  },
  {
    "姓名": "朱啟南",
    "出生地": "鹿港",
    "生年": 1874,
    "卒年": 1974
  },
  {
    "姓名": "江清柳",
    "出生地": "員林",
    "生年": 1935,
    "卒年": 2004
  },
  {
    "姓名": "江清露",
    "出生地": "永靖",
    "生年": 1914,
    "卒年": 1994
  },
  {
    "姓名": "何挨",
    "出生地": "溪湖",
    "生年": 1901,
    "卒年": 1969
  },
  {
    "姓名": "余垂宗",
    "出生地": "竹塘",
    "生年": 1921,
    "卒年": 2004
  },
  {
    "姓名": "余德煌",
    "出生地": "北斗",
    "生年": 1914,
    "卒年": 1996
  },
  {
    "姓名": "吳德功",
    "出生地": "彰化",
    "生年": 1850,
    "卒年": 1924
  },
  {
    "姓名": "吳上花",
    "出生地": "彰化",
    "生年": 1893,
    "卒年": 1984
  },
  {
    "姓名": "吳火蔭",
    "出生地": "大村",
    "生年": 1863,
    "卒年": 1940
  },
  {
    "姓名": "吳半樵",
    "出生地": "田中",
    "生年": 1881,
    "卒年": 1965
  },
  {
    "姓名": "吳守禮",
    "出生地": "臺北",
    "生年": 1909,
    "卒年": 2005
  },
  {
    "姓名": "吳彩臣",
    "出生地": "溪湖",
    "生年": 1857,
    "卒年": 1911
  },
  {
    "姓名": "吳望蘇",
    "出生地": "彰化",
    "生年": 1868,
    "卒年": 1932
  },
  {
    "姓名": "吳清波",
    "出生地": "鹿港",
    "生年": 1931,
    "卒年": 2012
  },
  {
    "姓名": "吳朝花",
    "出生地": "大村",
    "生年": 1921,
    "卒年": 2015
  },
  {
    "姓名": "吳慶堂",
    "出生地": "彰化",
    "生年": 1911,
    "卒年": 1995
  },
  {
    "姓名": "吳練",
    "出生地": "大城",
    "生年": 1895,
    "卒年": 1960
  },
  {
    "姓名": "吳蘅秋",
    "出生地": "彰化",
    "生年": 1900,
    "卒年": 1954
  },
  {
    "姓名": "呂喬南",
    "出生地": "鹿港",
    "生年": 1864,
    "卒年": 1918
  },
  {
    "姓名": "呂嶽",
    "出生地": "鹿港",
    "生年": 1900,
    "卒年": 1988
  },
  {
    "姓名": "呂訴上",
    "出生地": "臺北",
    "生年": 1915,
    "卒年": 1970
  },
  {
    "姓名": "李木坤",
    "出生地": "鹿港",
    "生年": 1920,
    "卒年": 2011
  },
  {
    "姓名": "李白庚",
    "出生地": "花壇",
    "生年": 1876,
    "卒年": 1947
  },
  {
    "姓名": "李仲生",
    "出生地": "彰化",
    "生年": 1912,
    "卒年": 1984
  },
  {
    "姓名": "李成章",
    "出生地": "花壇",
    "生年": 1936,
    "卒年": 2010
  },
  {
    "姓名": "李松林",
    "出生地": "鹿港",
    "生年": 1907,
    "卒年": 1998
  },
  {
    "姓名": "李清琦",
    "出生地": "福建南安",
    "生年": 1856,
    "卒年": ""
  },
  {
    "姓名": "施之東",
    "出生地": "鹿港",
    "生年": 1859,
    "卒年": 1928
  },
  {
    "姓名": "施少雨",
    "出生地": "鹿港",
    "生年": 1868,
    "卒年": 1950
  },
  {
    "姓名": "施文炳",
    "出生地": "鹿港",
    "生年": 1931,
    "卒年": 2014
  },
  {
    "姓名": "施水龍",
    "出生地": "鹿港",
    "生年": 1900,
    "卒年": 1990
  },
  {
    "姓名": "施至煖",
    "出生地": "鹿港",
    "生年": 1925,
    "卒年": 1998
  },
  {
    "姓名": "施坤玉",
    "出生地": "鹿港",
    "生年": 1919,
    "卒年": 2010
  },
  {
    "姓名": "施性湍",
    "出生地": "鹿港",
    "生年": 1905,
    "卒年": 1937
  },
  {
    "姓名": "施建連",
    "出生地": "埔鹽",
    "生年": 1902,
    "卒年": 1987
  },
  {
    "姓名": "施家本",
    "出生地": "鹿港",
    "生年": 1886,
    "卒年": 1921
  },
  {
    "姓名": "施強",
    "出生地": "鹿港",
    "生年": 1876,
    "卒年": 1943
  },
  {
    "姓名": "施菼",
    "出生地": "鹿港",
    "生年": 1848,
    "卒年": 1909
  },
  {
    "姓名": "施梅樵",
    "出生地": "鹿港",
    "生年": 1870,
    "卒年": 1949
  },
  {
    "姓名": "施葆修",
    "出生地": "鹿港",
    "生年": 1845,
    "卒年": 1893
  },
  {
    "姓名": "施壽柏",
    "出生地": "臺中",
    "生年": 1893,
    "卒年": 1966
  },
  {
    "姓名": "施學習",
    "出生地": "臺北",
    "生年": 1903,
    "卒年": 1995
  },
  {
    "姓名": "施禮",
    "出生地": "鹿港",
    "生年": 1903,
    "卒年": 1985
  },
  {
    "姓名": "施讓甫",
    "出生地": "員林",
    "生年": 1900,
    "卒年": 1967
  },
  {
    "姓名": "柯煥章",
    "出生地": "和美",
    "生年": 1901,
    "卒年": 1973
  },
  {
    "姓名": "洪以倫",
    "出生地": "芳苑",
    "生年": 1870,
    "卒年": 1925
  },
  {
    "姓名": "洪能傳",
    "出生地": "二林",
    "生年": 1897,
    "卒年": 1977
  },
  {
    "姓名": "洪棄生",
    "出生地": "鹿港",
    "生年": 1866,
    "卒年": 1928
  },
  {
    "姓名": "洪炎秋",
    "出生地": "臺北",
    "生年": 1902,
    "卒年": 1980
  },
  {
    "姓名": "洪炳照",
    "出生地": "北斗",
    "生年": 1889,
    "卒年": 1980
  },
  {
    "姓名": "洪爾桐",
    "出生地": "二林",
    "生年": 1860,
    "卒年": 1925
  },
  {
    "姓名": "洪醒夫",
    "出生地": "二林",
    "生年": 1949,
    "卒年": 1982
  },
  {
    "姓名": "洪寶昆",
    "出生地": "二林",
    "生年": 1906,
    "卒年": 1974
  },
  {
    "姓名": "胡允中",
    "出生地": "溪湖",
    "生年": 1908,
    "卒年": 1983
  },
  {
    "姓名": "徐元勳",
    "出生地": "埔心",
    "生年": 1898,
    "卒年": 1976
  },
  {
    "姓名": "徐見賢",
    "出生地": "永靖",
    "生年": 1890,
    "卒年": 1949
  },
  {
    "姓名": "翁鬧",
    "出生地": "社頭",
    "生年": 1910,
    "卒年": 1940
  },
  {
    "姓名": "高泰山",
    "出生地": "員林",
    "生年": 1912,
    "卒年": 1994
  },
  {
    "姓名": "張煥彩",
    "出生地": "員林",
    "生年": 1930,
    "卒年": 2009
  },
  {
    "姓名": "張瑞和",
    "出生地": "永靖",
    "生年": 1957,
    "卒年": 2012
  },
  {
    "姓名": "梁濟時",
    "出生地": "秀水",
    "生年": "",
    "卒年": ""
  },
  {
    "姓名": "莊士勳",
    "出生地": "鹿港",
    "生年": 1856,
    "卒年": 1918
  },
  {
    "姓名": "莊嵩",
    "出生地": "鹿港",
    "生年": 1880,
    "卒年": 1938
  },
  {
    "姓名": "莊垂勝",
    "出生地": "臺中",
    "生年": 1897,
    "卒年": 1962
  },
  {
    "姓名": "莊幼岳",
    "出生地": "臺北",
    "生年": 1916,
    "卒年": 2007
  },
  {
    "姓名": "莊添池",
    "出生地": "埔鹽",
    "生年": 1922,
    "卒年": 2002
  },
  {
    "姓名": "許文葵",
    "出生地": "臺中",
    "生年": 1900,
    "卒年": 1968
  },
  {
    "姓名": "許夢青",
    "出生地": "鹿港",
    "生年": 1870,
    "卒年": 1904
  },
  {
    "姓名": "許幼漁",
    "出生地": "和美",
    "生年": 1892,
    "卒年": 1953
  },
  {
    "姓名": "許常惠",
    "出生地": "臺北",
    "生年": 1929,
    "卒年": 2001
  },
  {
    "姓名": "許存德",
    "出生地": "二林/竹塘",
    "生年": 1868,
    "卒年": 1929
  },
  {
    "姓名": "許百鑄",
    "出生地": "北斗",
    "生年": 1883,
    "卒年": 1949
  },
  {
    "姓名": "許志呈",
    "出生地": "福興",
    "生年": 1919,
    "卒年": 1998
  },
  {
    "姓名": "許逸漁",
    "出生地": "和美",
    "生年": 1887,
    "卒年": 1957
  },
  {
    "姓名": "許漢卿",
    "出生地": "鹿港",
    "生年": 1937,
    "卒年": 2012
  },
  {
    "姓名": "許蒼澤",
    "出生地": "鹿港",
    "生年": 1930,
    "卒年": 2006
  },
  {
    "姓名": "康丁",
    "出生地": "臺北",
    "生年": 1936,
    "卒年": 2011
  },
  {
    "姓名": "郭友梅",
    "出生地": "鹿港",
    "生年": 1849,
    "卒年": 1915
  },
  {
    "姓名": "郭新林",
    "出生地": "鹿港",
    "生年": 1898,
    "卒年": 1973
  },
  {
    "姓名": "曾作霖",
    "出生地": "彰化",
    "生年": "",
    "卒年": ""
  },
  {
    "姓名": "曾維楨",
    "出生地": "花壇",
    "生年": "",
    "卒年": ""
  },
  {
    "姓名": "陳子敏",
    "出生地": "鹿港",
    "生年": 1887,
    "卒年": 1948
  },
  {
    "姓名": "陳允成",
    "出生地": "田中",
    "生年": 1913,
    "卒年": 2009
  },
  {
    "姓名": "陳元音",
    "出生地": "北斗",
    "生年": 1847,
    "卒年": 1896
  },
  {
    "姓名": "陳元亨",
    "出生地": "雲林莿桐",
    "生年": 1876,
    "卒年": 1940
  },
  {
    "姓名": "陳火泉",
    "出生地": "臺北",
    "生年": 1908,
    "卒年": 1999
  },
  {
    "姓名": "陳木川",
    "出生地": "員林",
    "生年": 1918,
    "卒年": 2009
  },
  {
    "姓名": "陳光昌",
    "出生地": "彰化",
    "生年": "",
    "卒年": 1855
  },
  {
    "姓名": "陳亦樵",
    "出生地": "鹿港",
    "生年": 1847,
    "卒年": 1891
  },
  {
    "姓名": "陳再得",
    "出生地": "芳苑",
    "生年": 1929,
    "卒年": 2005
  },
  {
    "姓名": "陳助麟",
    "出生地": "彰化",
    "生年": 1933,
    "卒年": 2011
  },
  {
    "姓名": "陳育英",
    "出生地": "永靖",
    "生年": 1840,
    "卒年": 1911
  },
  {
    "姓名": "陳坤輝",
    "出生地": "田中",
    "生年": 1892,
    "卒年": 1951
  },
  {
    "姓名": "陳宗潢",
    "出生地": "鹿港",
    "生年": "",
    "卒年": 1868
  },
  {
    "姓名": "陳恆嘉",
    "出生地": "溪州",
    "生年": 1944,
    "卒年": 2009
  },
  {
    "姓名": "陳眛",
    "出生地": "永靖",
    "生年": 1880,
    "卒年": 1969
  },
  {
    "姓名": "陳炳桑",
    "出生地": "永靖",
    "生年": 1909,
    "卒年": 2000
  },
  {
    "姓名": "陳貞元",
    "出生地": "田中",
    "生年": "",
    "卒年": 1869
  },
  {
    "姓名": "陳培松",
    "出生地": "秀水",
    "生年": 1836,
    "卒年": 1872
  },
  {
    "姓名": "陳捷華",
    "出生地": "花壇",
    "生年": 1849,
    "卒年": 1903
  },
  {
    "姓名": "陳紹年",
    "出生地": "田中",
    "生年": 1852,
    "卒年": 1915
  },
  {
    "姓名": "陳渭雄",
    "出生地": "彰化",
    "生年": 1899,
    "卒年": 1961
  },
  {
    "姓名": "陳湛恩",
    "出生地": "秀水",
    "生年": 1867,
    "卒年": 1926
  },
  {
    "姓名": "陳虛谷",
    "出生地": "和美",
    "生年": 1896,
    "卒年": 1965
  },
  {
    "姓名": "陳傳纘",
    "出生地": "秀水",
    "生年": 1910,
    "卒年": 1998
  },
  {
    "姓名": "陳瑞記",
    "出生地": "溪湖",
    "生年": 1892,
    "卒年": 1952
  },
  {
    "姓名": "陳肇興",
    "出生地": "彰化",
    "生年": 1831,
    "卒年": 1866
  },
  {
    "姓名": "辜偉甫",
    "出生地": "臺北",
    "生年": 1918,
    "卒年": 1982
  },
  {
    "姓名": "黃三元",
    "出生地": "臺北",
    "生年": 1935,
    "卒年": 1999
  },
  {
    "姓名": "黃大山",
    "出生地": "埔心",
    "生年": 1924,
    "卒年": 1999
  },
  {
    "姓名": "黃元璧",
    "出生地": "彰化",
    "生年": 1846,
    "卒年": 1920
  },
  {
    "姓名": "黃天素",
    "出生地": "鹿港",
    "生年": 1907,
    "卒年": 1996
  },
  {
    "姓名": "黃以德",
    "出生地": "永靖",
    "生年": 1905,
    "卒年": 1983
  },
  {
    "姓名": "黃玉書",
    "出生地": "鹿港",
    "生年": 1844,
    "卒年": 1889
  },
  {
    "姓名": "黃有?",
    "出生地": "大村",
    "生年": 1921,
    "卒年": 2002
  },
  {
    "姓名": "黃孜業",
    "出生地": "員林",
    "生年": 1851,
    "卒年": 1928
  },
  {
    "姓名": "黃周",
    "出生地": "和美",
    "生年": 1899,
    "卒年": 1957
  },
  {
    "姓名": "黃臥松",
    "出生地": "彰化",
    "生年": 1876,
    "卒年": 1944
  },
  {
    "姓名": "黃祖輝",
    "出生地": "鹿港",
    "生年": 1896,
    "卒年": 1961
  },
  {
    "姓名": "黃添旺",
    "出生地": "線西",
    "生年": 1905,
    "卒年": 1981
  },
  {
    "姓名": "黃清廉",
    "出生地": "埤頭",
    "生年": 1884,
    "卒年": 1943
  },
  {
    "姓名": "黃溥造",
    "出生地": "員林",
    "生年": 1889,
    "卒年": 1959
  },
  {
    "姓名": "黃煥奎",
    "出生地": "鹿港",
    "生年": "",
    "卒年": ""
  },
  {
    "姓名": "黃煥斗",
    "出生地": "鹿港",
    "生年": 1866,
    "卒年": 1943
  },
  {
    "姓名": "黃圖",
    "出生地": "田尾",
    "生年": 1902,
    "卒年": 1976
  },
  {
    "姓名": "黃龍江",
    "出生地": "田中",
    "生年": 1909,
    "卒年": 2010
  },
  {
    "姓名": "丁瑞彬",
    "出生地": "鹿港",
    "生年": 1898,
    "卒年": 1979
  },
  {
    "姓名": "丸山喜一郎",
    "出生地": "日本長野縣",
    "生年": 1890,
    "卒年": ""
  },
  {
    "姓名": "于國楨",
    "出生地": "北京市",
    "生年": 1900,
    "卒年": 1952
  },
  {
    "姓名": "土橋仲治",
    "出生地": "日本和歌山縣",
    "生年": 1883,
    "卒年": ""
  },
  {
    "姓名": "王永宗",
    "出生地": "中國/臺北",
    "生年": 1895,
    "卒年": 1959
  },
  {
    "姓名": "王康旼",
    "出生地": "中國/臺北",
    "生年": 1927,
    "卒年": 2008
  },
  {
    "姓名": "王康陸",
    "出生地": "美國",
    "生年": 1941,
    "卒年": 1993
  },
  {
    "姓名": "王敏川",
    "出生地": "彰化",
    "生年": 1887,
    "卒年": 1942
  },
  {
    "姓名": "王福入",
    "出生地": "鹿港",
    "生年": 1930,
    "卒年": 1993
  },
  {
    "姓名": "王福元",
    "出生地": "溪州",
    "生年": 1950,
    "卒年": 2007
  },
  {
    "姓名": "王燈岸",
    "出生地": "彰化",
    "生年": 1920,
    "卒年": 1985
  },
  {
    "姓名": "王顯明",
    "出生地": "彰化",
    "生年": 1941,
    "卒年": 1997
  },
  {
    "姓名": "甘得中",
    "出生地": "秀水/花壇",
    "生年": 1883,
    "卒年": 1964
  },
  {
    "姓名": "石錫勳",
    "出生地": "彰化",
    "生年": 1900,
    "卒年": 1985
  },
  {
    "姓名": "寺尾德右衛門",
    "出生地": "日本愛知縣",
    "生年": 1890,
    "卒年": ""
  },
  {
    "姓名": "朱山",
    "出生地": "浙江歸安",
    "生年": "",
    "卒年": ""
  },
  {
    "姓名": "江火社",
    "出生地": "員林",
    "生年": 1908,
    "卒年": 2009
  },
  {
    "姓名": "江纘禹",
    "出生地": "員林",
    "生年": 1900,
    "卒年": 1963
  },
  {
    "姓名": "西澤時藏",
    "出生地": "日本長野縣",
    "生年": 1876,
    "卒年": 1941
  },
  {
    "姓名": "吳木朝",
    "出生地": "大村",
    "生年": 1886,
    "卒年": 1950
  },
  {
    "姓名": "吳石麟",
    "出生地": "彰化",
    "生年": 1902,
    "卒年": 1976
  },
  {
    "姓名": "吳在琨",
    "出生地": "埤頭",
    "生年": 1909,
    "卒年": 1996
  },
  {
    "姓名": "吳廷發",
    "出生地": "埤頭",
    "生年": 1887,
    "卒年": 1963
  },
  {
    "姓名": "吳良銀",
    "出生地": "埤頭",
    "生年": 1890,
    "卒年": 1961
  },
  {
    "姓名": "吳來興",
    "出生地": "北斗/臺北",
    "生年": 1914,
    "卒年": 1982
  },
  {
    "姓名": "吳性誠",
    "出生地": "湖北黃安",
    "生年": "",
    "卒年": 1826
  },
  {
    "姓名": "吳恭",
    "出生地": "彰化",
    "生年": 1901,
    "卒年": 1984
  },
  {
    "姓名": "吳崇雄",
    "出生地": "彰化",
    "生年": 1924,
    "卒年": 1984
  },
  {
    "姓名": "吳清波",
    "出生地": "彰化",
    "生年": 1879,
    "卒年": 1928
  },
  {
    "姓名": "吳萬益",
    "出生地": "大城",
    "生年": 1867,
    "卒年": 1941
  },
  {
    "姓名": "吳連吟",
    "出生地": "大城",
    "生年": 1905,
    "卒年": 1986
  },
  {
    "姓名": "吳瀛士",
    "出生地": "大城",
    "生年": 1902,
    "卒年": 1986
  },
  {
    "姓名": "吳榮興",
    "出生地": "溪湖",
    "生年": 1927,
    "卒年": 2014
  },
  {
    "姓名": "呂世明",
    "出生地": "彰化",
    "生年": 1901,
    "卒年": 1992
  },
  {
    "姓名": "宋學灝",
    "出生地": "",
    "生年": 1739,
    "卒年": ""
  },
  {
    "姓名": "巫長順",
    "出生地": "溪湖",
    "生年": 1905,
    "卒年": 1975
  },
  {
    "姓名": "折笠龍藏",
    "出生地": "日本福島縣",
    "生年": 1888,
    "卒年": ""
  },
  {
    "姓名": "李山火",
    "出生地": "中國",
    "生年": 1904,
    "卒年": ""
  },
  {
    "姓名": "李炳?",
    "出生地": "福興",
    "生年": 1910,
    "卒年": 1987
  },
  {
    "姓名": "李碧鏘",
    "出生地": "彰化",
    "生年": 1923,
    "卒年": 2007
  },
  {
    "姓名": "李慶義",
    "出生地": "花壇",
    "生年": 1911,
    "卒年": 1989
  },
  {
    "姓名": "李應章",
    "出生地": "中國",
    "生年": 1897,
    "卒年": 1954
  },
  {
    "姓名": "李聲洲",
    "出生地": "埔鹽",
    "生年": 1868,
    "卒年": 1933
  },
  {
    "姓名": "李讀",
    "出生地": "員林",
    "生年": 1923,
    "卒年": 2015
  },
  {
    "姓名": "卓金水",
    "出生地": "北斗",
    "生年": 1896,
    "卒年": 1961
  },
  {
    "姓名": "卓建國",
    "出生地": "北斗",
    "生年": 1946,
    "卒年": 2003
  },
  {
    "姓名": "周天啟",
    "出生地": "伸港",
    "生年": 1906,
    "卒年": 1971
  },
  {
    "姓名": "施印",
    "出生地": "埔鹽",
    "生年": 1876,
    "卒年": 1912
  },
  {
    "姓名": "施來",
    "出生地": "鹿港",
    "生年": 1861,
    "卒年": 1928
  },
  {
    "姓名": "施受業",
    "出生地": "鹿港",
    "生年": 1860,
    "卒年": 1924
  },
  {
    "姓名": "施曾登",
    "出生地": "埔鹽",
    "生年": 1707,
    "卒年": ""
  },
  {
    "姓名": "施榮",
    "出生地": "員林",
    "生年": 1881,
    "卒年": 1942
  },
  {
    "姓名": "施範其",
    "出生地": "廈門",
    "生年": 1875,
    "卒年": ""
  },
  {
    "姓名": "施應成",
    "出生地": "鹿港",
    "生年": "",
    "卒年": ""
  },
  {
    "姓名": "施藍田",
    "出生地": "鹿港",
    "生年": 1888,
    "卒年": 1974
  },
  {
    "姓名": "施議祥",
    "出生地": "鹿港",
    "生年": 1881,
    "卒年": 1953
  },
  {
    "姓名": "柯批",
    "出生地": "伸港",
    "生年": 1910,
    "卒年": 1989
  },
  {
    "姓名": "柯福",
    "出生地": "北斗",
    "生年": 1900,
    "卒年": 1959
  },
  {
    "姓名": "柯慶瑞",
    "出生地": "北斗",
    "生年": 1911,
    "卒年": 1953
  },
  {
    "姓名": "柯謀",
    "出生地": "臺中",
    "生年": 1893,
    "卒年": 1964
  },
  {
    "姓名": "洪天佑",
    "出生地": "鹿港",
    "生年": "",
    "卒年": ""
  },
  {
    "姓名": "洪斗",
    "出生地": "沙鹿",
    "生年": 1885,
    "卒年": 1977
  },
  {
    "姓名": "洪竹頭",
    "出生地": "北斗",
    "生年": 1913,
    "卒年": 1991
  },
  {
    "姓名": "洪金發",
    "出生地": "和美",
    "生年": 1907,
    "卒年": 1981
  },
  {
    "姓名": "洪掛",
    "出生地": "沙鹿/臺東",
    "生年": 1906,
    "卒年": 2005
  },
  {
    "姓名": "洪維章",
    "出生地": "芳苑",
    "生年": 1892,
    "卒年": 1961
  },
  {
    "姓名": "洪?耳",
    "出生地": "芬園",
    "生年": 1873,
    "卒年": 1945
  },
  {
    "姓名": "洪錫佛",
    "出生地": "員林",
    "生年": 1901,
    "卒年": 1987
  },
  {
    "姓名": "胡改量",
    "出生地": "田尾",
    "生年": 1916,
    "卒年": 2013
  },
  {
    "姓名": "唐焜煌",
    "出生地": "花壇",
    "生年": 1875,
    "卒年": 1924
  },
  {
    "姓名": "徐石慶",
    "出生地": "溪湖",
    "生年": 1904,
    "卒年": 1980
  },
  {
    "姓名": "翁廷泉",
    "出生地": "二林",
    "生年": 1891,
    "卒年": 1961
  },
  {
    "姓名": "張土墻",
    "出生地": "社頭",
    "生年": 1900,
    "卒年": 1967
  },
  {
    "姓名": "張日昌",
    "出生地": "彰化",
    "生年": 1888,
    "卒年": 1950
  },
  {
    "姓名": "張其深",
    "出生地": "二水",
    "生年": 1884,
    "卒年": 1928
  },
  {
    "姓名": "張炎清",
    "出生地": "芬園",
    "生年": 1899,
    "卒年": 1976
  },
  {
    "姓名": "張芳振",
    "出生地": "員林",
    "生年": 1874,
    "卒年": 1946
  },
  {
    "姓名": "張國鄰",
    "出生地": "二水",
    "生年": 1899,
    "卒年": 1950
  },
  {
    "姓名": "張清華",
    "出生地": "員林",
    "生年": 1884,
    "卒年": 1948
  },
  {
    "姓名": "張湖",
    "出生地": "員林",
    "生年": 1899,
    "卒年": 1975
  },
  {
    "姓名": "張董",
    "出生地": "員林",
    "生年": 1871,
    "卒年": 1927
  },
  {
    "姓名": "張銅水",
    "出生地": "員林",
    "生年": 1909,
    "卒年": 1944
  },
  {
    "姓名": "張養民",
    "出生地": "北斗",
    "生年": 1921,
    "卒年": 2004
  },
  {
    "姓名": "曹火爐",
    "出生地": "員林",
    "生年": 1902,
    "卒年": 1942
  },
  {
    "姓名": "曹芊",
    "出生地": "員林",
    "生年": 1885,
    "卒年": 1943
  },
  {
    "姓名": "曹連美",
    "出生地": "員林",
    "生年": 1918,
    "卒年": 1995
  },
  {
    "姓名": "莊金元",
    "出生地": "大村",
    "生年": 1894,
    "卒年": 1941
  },
  {
    "姓名": "許水麃",
    "出生地": "田尾",
    "生年": 1909,
    "卒年": 1989
  },
  {
    "姓名": "許金圳",
    "出生地": "福興",
    "生年": 1904,
    "卒年": 1947
  },
  {
    "姓名": "許金盾",
    "出生地": "二林",
    "生年": 1912,
    "卒年": 1967
  },
  {
    "姓名": "許祐德",
    "出生地": "鹿港",
    "生年": "",
    "卒年": ""
  },
  {
    "姓名": "許望",
    "出生地": "埤頭",
    "生年": 1905,
    "卒年": 1989
  },
  {
    "姓名": "許梅舫",
    "出生地": "鹿港",
    "生年": 1866,
    "卒年": 1940
  },
  {
    "姓名": "郭木生",
    "出生地": "芳苑",
    "生年": 1933,
    "卒年": 2013
  },
  {
    "姓名": "郭腦",
    "出生地": "鹿港",
    "生年": 1891,
    "卒年": 1938
  },
  {
    "姓名": "陳七",
    "出生地": "田尾",
    "生年": 1908,
    "卒年": 1989
  },
  {
    "姓名": "周連山",
    "出生地": "彰化",
    "生年": "",
    "卒年": 1904
  },
  {
    "姓名": "周鍾瑄",
    "出生地": "貴州貴筑",
    "生年": 1671,
    "卒年": 1762
  },
  {
    "姓名": "林文騰",
    "出生地": "中國",
    "生年": 1893,
    "卒年": 1978
  },
  {
    "姓名": "林如金",
    "出生地": "北斗",
    "生年": 1905,
    "卒年": 1996
  },
  {
    "姓名": "林有信",
    "出生地": "彰化",
    "生年": 1886,
    "卒年": 1954
  },
  {
    "姓名": "林伯可",
    "出生地": "臺北/日本",
    "生年": 1902,
    "卒年": ""
  },
  {
    "姓名": "林慶岐",
    "出生地": "北斗",
    "生年": 1859,
    "卒年": 1912
  },
  {
    "姓名": "林慶賢",
    "出生地": "北斗",
    "生年": 1863,
    "卒年": 1914
  },
  {
    "姓名": "林國珍",
    "出生地": "北斗",
    "生年": 1956,
    "卒年": 2008
  },
  {
    "姓名": "林清溪",
    "出生地": "芳苑",
    "生年": 1909,
    "卒年": 1978
  },
  {
    "姓名": "林連宗",
    "出生地": "彰化",
    "生年": 1904,
    "卒年": 1947
  },
  {
    "姓名": "林朝業",
    "出生地": "員林",
    "生年": 1913,
    "卒年": 2009
  },
  {
    "姓名": "林伯廷",
    "出生地": "北斗",
    "生年": 1886,
    "卒年": 1966
  },
  {
    "姓名": "林伯殳",
    "出生地": "大城/田尾",
    "生年": 1895,
    "卒年": 1973
  },
  {
    "姓名": "林伯餘",
    "出生地": "北斗",
    "生年": 1897,
    "卒年": 1968
  },
  {
    "姓名": "林仲節",
    "出生地": "北斗",
    "生年": 1907,
    "卒年": 1963
  },
  {
    "姓名": "林錦文",
    "出生地": "彰化",
    "生年": 1921,
    "卒年": 1953
  },
  {
    "姓名": "邱樹火",
    "出生地": "永靖",
    "生年": 1909,
    "卒年": 1972
  },
  {
    "姓名": "俞峻",
    "出生地": "浙江臨安",
    "生年": "",
    "卒年": ""
  },
  {
    "姓名": "施子滔",
    "出生地": "埔鹽",
    "生年": 1917,
    "卒年": 1994
  },
  {
    "姓名": "施文坡",
    "出生地": "鹿港",
    "生年": 1892,
    "卒年": 1964
  },
  {
    "姓名": "施水",
    "出生地": "北斗",
    "生年": 1905,
    "卒年": 1965
  },
  {
    "姓名": "施至善",
    "出生地": "中國",
    "生年": 1881,
    "卒年": ""
  },
  {
    "姓名": "施松輝",
    "出生地": "埔鹽",
    "生年": 1937,
    "卒年": 2010
  },
  {
    "姓名": "施金協",
    "出生地": "埔鹽",
    "生年": 1935,
    "卒年": 1991
  },
  {
    "姓名": "施萬示",
    "出生地": "埔鹽",
    "生年": 1901,
    "卒年": 1981
  },
  {
    "姓名": "施蕃薯",
    "出生地": "花壇",
    "生年": 1906,
    "卒年": 1964
  },
  {
    "姓名": "柯扱",
    "出生地": "伸港",
    "生年": 1911,
    "卒年": 1975
  },
  {
    "姓名": "洪光車",
    "出生地": "二林",
    "生年": 1831,
    "卒年": 1914
  },
  {
    "姓名": "洪勇",
    "出生地": "芳苑",
    "生年": 1923,
    "卒年": 1992
  },
  {
    "姓名": "洪挑",
    "出生地": "二林",
    "生年": 1903,
    "卒年": 1991
  },
  {
    "姓名": "洪福",
    "出生地": "二林",
    "生年": 1896,
    "卒年": 1952
  },
  {
    "姓名": "洪學堯",
    "出生地": "芳苑",
    "生年": 1864,
    "卒年": 1932
  },
  {
    "姓名": "洪歡喜",
    "出生地": "芳苑",
    "生年": 1915,
    "卒年": 1979
  },
  {
    "姓名": "胡邦翰",
    "出生地": "浙江餘姚",
    "生年": 1712,
    "卒年": ""
  },
  {
    "姓名": "胡應魁",
    "出生地": "江蘇丹陽",
    "生年": 1745,
    "卒年": ""
  },
  {
    "姓名": "唐尹中",
    "出生地": "花壇",
    "生年": "",
    "卒年": 1905
  },
  {
    "姓名": "徐堅",
    "出生地": "埔心",
    "生年": 1913,
    "卒年": 1975
  },
  {
    "姓名": "秦士望",
    "出生地": "安徽宿州",
    "生年": "",
    "卒年": ""
  },
  {
    "姓名": "翁煌",
    "出生地": "埔鹽",
    "生年": 1909,
    "卒年": 1992
  },
  {
    "姓名": "高執德",
    "出生地": "臺南",
    "生年": 1895,
    "卒年": 1955
  },
  {
    "姓名": "康傳",
    "出生地": "埔鹽",
    "生年": 1904,
    "卒年": 1940
  },
  {
    "姓名": "張水蒼",
    "出生地": "臺北",
    "生年": 1910,
    "卒年": 1980
  },
  {
    "姓名": "張世珍",
    "出生地": "陝西臨潼",
    "生年": "",
    "卒年": ""
  },
  {
    "姓名": "張玉花",
    "出生地": "員林",
    "生年": 1918,
    "卒年": 1977
  },
  {
    "姓名": "張有火",
    "出生地": "永靖",
    "生年": 1891,
    "卒年": 1957
  },
  {
    "姓名": "張廷彬",
    "出生地": "北斗",
    "生年": 1913,
    "卒年": 2001
  },
  {
    "姓名": "張良慶",
    "出生地": "員林",
    "生年": 1905,
    "卒年": 1985
  },
  {
    "姓名": "張尚鏞",
    "出生地": "埔心",
    "生年": 1904,
    "卒年": 1995
  },
  {
    "姓名": "張秉榮",
    "出生地": "和美",
    "生年": 1876,
    "卒年": 1949
  },
  {
    "姓名": "張清柳",
    "出生地": "員林",
    "生年": 1891,
    "卒年": 1956
  },
  {
    "姓名": "張清風",
    "出生地": "埤頭",
    "生年": 1898,
    "卒年": 1982
  },
  {
    "姓名": "張期華",
    "出生地": "彰化",
    "生年": 1917,
    "卒年": 1998
  },
  {
    "姓名": "張達",
    "出生地": "員林",
    "生年": 1909,
    "卒年": 1980
  },
  {
    "姓名": "張龍池",
    "出生地": "芬園",
    "生年": 1888,
    "卒年": 1968
  },
  {
    "姓名": "曹開",
    "出生地": "員林",
    "生年": 1929,
    "卒年": 1997
  },
  {
    "姓名": "梁炎山",
    "出生地": "秀水",
    "生年": 1870,
    "卒年": 1933
  },
  {
    "姓名": "梁火煌",
    "出生地": "秀水",
    "生年": 1912,
    "卒年": 2013
  },
  {
    "姓名": "莊士哲",
    "出生地": "鹿港",
    "生年": 1853,
    "卒年": 1919
  },
  {
    "姓名": "莊日",
    "出生地": "竹塘",
    "生年": 1879,
    "卒年": 1951
  },
  {
    "姓名": "莊北斗",
    "出生地": "竹塘",
    "生年": 1910,
    "卒年": 1973
  },
  {
    "姓名": "許嘉種",
    "出生地": "彰化",
    "生年": 1883,
    "卒年": 1954
  },
  {
    "姓名": "許乃昌",
    "出生地": "彰化",
    "生年": 1907,
    "卒年": 1975
  },
  {
    "姓名": "許子哲",
    "出生地": "竹塘",
    "生年": 1918,
    "卒年": 1990
  },
  {
    "姓名": "許在泮",
    "出生地": "和美",
    "生年": 1879,
    "卒年": 1953
  },
  {
    "姓名": "許遜謙",
    "出生地": "秀水",
    "生年": 1879,
    "卒年": 1943
  },
  {
    "姓名": "郭農富",
    "出生地": "二林",
    "生年": 1916,
    "卒年": 1947
  },
  {
    "姓名": "陳玉清",
    "出生地": "田尾",
    "生年": 1928,
    "卒年": 2003
  },
  {
    "姓名": "陳石財",
    "出生地": "二林",
    "生年": 1909,
    "卒年": 1982
  },
  {
    "姓名": "陳再福",
    "出生地": "田中",
    "生年": 1905,
    "卒年": 1985
  },
  {
    "姓名": "陳汝甘",
    "出生地": "永靖",
    "生年": 1872,
    "卒年": 1920
  },
  {
    "姓名": "陳秀卿",
    "出生地": "福興",
    "生年": 1950,
    "卒年": 2011
  },
  {
    "姓名": "陳忠",
    "出生地": "田尾",
    "生年": 1900,
    "卒年": 1991
  },
  {
    "姓名": "陳炎星",
    "出生地": "埤頭",
    "生年": 1878,
    "卒年": 1940
  },
  {
    "姓名": "陳勇",
    "出生地": "二水",
    "生年": 1893,
    "卒年": 1954
  },
  {
    "姓名": "陳南山",
    "出生地": "和美",
    "生年": 1903,
    "卒年": 1966
  },
  {
    "姓名": "陳建上",
    "出生地": "芳苑",
    "生年": 1890,
    "卒年": 1950
  },
  {
    "姓名": "陳家琛",
    "出生地": "秀水",
    "生年": 1907,
    "卒年": 2000
  },
  {
    "姓名": "陳振雄",
    "出生地": "彰化",
    "生年": 1944,
    "卒年": 2007
  },
  {
    "姓名": "陳時英",
    "出生地": "田中",
    "生年": 1926,
    "卒年": 1995
  },
  {
    "姓名": "李篤恭",
    "出生地": "彰化",
    "生年": 1929,
    "卒年": 2005
  },
  {
    "姓名": "卓勝利",
    "出生地": "臺北",
    "生年": 1949,
    "卒年": 2012
  },
  {
    "姓名": "周水松",
    "出生地": "伸港",
    "生年": 1936,
    "卒年": 1999
  },
  {
    "姓名": "周希珍",
    "出生地": "二林",
    "生年": 1936,
    "卒年": 2004
  },
  {
    "姓名": "周定山",
    "出生地": "鹿港",
    "生年": 1898,
    "卒年": 1975
  },
  {
    "姓名": "周長庚",
    "出生地": "福建侯官",
    "生年": 1847,
    "卒年": ""
  },
  {
    "姓名": "周遜寬",
    "出生地": "彰化",
    "生年": 1920,
    "卒年": 2002
  },
  {
    "姓名": "松元勇助",
    "出生地": "日本鹿兒島縣",
    "生年": 1890,
    "卒年": ""
  },
  {
    "姓名": "林丁輝",
    "出生地": "社頭",
    "生年": 1899,
    "卒年": 1977
  },
  {
    "姓名": "林上德",
    "出生地": "北斗",
    "生年": 1916,
    "卒年": 1999
  },
  {
    "姓名": "林天爵",
    "出生地": "員林",
    "生年": 1875,
    "卒年": 1935
  },
  {
    "姓名": "林仲荃",
    "出生地": "北斗",
    "生年": 1921,
    "卒年": 2003
  },
  {
    "姓名": "林旭禎",
    "出生地": "鹿港",
    "生年": 1938,
    "卒年": 2011
  },
  {
    "姓名": "林荊南",
    "出生地": "北斗",
    "生年": 1915,
    "卒年": 2002
  },
  {
    "姓名": "林錦鴻",
    "出生地": "芬園",
    "生年": 1905,
    "卒年": 1985
  },
  {
    "姓名": "林寶鏞",
    "出生地": "彰化",
    "生年": 1858,
    "卒年": 1925
  },
  {
    "姓名": "邱妙津",
    "出生地": "員林",
    "生年": 1969,
    "卒年": 1995
  },
  {
    "姓名": "邱金墻",
    "出生地": "永靖",
    "生年": 1912,
    "卒年": 1999
  },
  {
    "姓名": "邱淼鏘",
    "出生地": "田尾",
    "生年": 1909,
    "卒年": 1989
  },
  {
    "姓名": "邱萃英",
    "出生地": "永靖",
    "生年": 1825,
    "卒年": ""
  },
  {
    "姓名": "姚讚福",
    "出生地": "彰化",
    "生年": 1908,
    "卒年": 1967
  },
  {
    "姓名": "奧島憲慶",
    "出生地": "日本沖繩縣",
    "生年": 1889,
    "卒年": ""
  },
  {
    "姓名": "楊木",
    "出生地": "彰化",
    "生年": 1898,
    "卒年": 1977
  },
  {
    "姓名": "楊守愚",
    "出生地": "彰化",
    "生年": 1905,
    "卒年": 1959
  },
  {
    "姓名": "楊杏林",
    "出生地": "北斗",
    "生年": 1899,
    "卒年": 1973
  },
  {
    "姓名": "楊笑儂",
    "出生地": "彰化",
    "生年": 1887,
    "卒年": 1982
  },
  {
    "姓名": "葉阿木",
    "出生地": "彰化",
    "生年": 1916,
    "卒年": 2001
  },
  {
    "姓名": "葉榮鐘",
    "出生地": "臺中",
    "生年": 1900,
    "卒年": 1978
  },
  {
    "姓名": "葉熊祈",
    "出生地": "鹿港",
    "生年": 1900,
    "卒年": 1989
  },
  {
    "姓名": "詹有義",
    "出生地": "竹塘",
    "生年": 1903,
    "卒年": 1983
  },
  {
    "姓名": "詹作舟",
    "出生地": "員林",
    "生年": 1891,
    "卒年": 1980
  },
  {
    "姓名": "詹煌輝",
    "出生地": "永靖",
    "生年": 1905,
    "卒年": 1986
  },
  {
    "姓名": "廖春波",
    "出生地": "鹿港",
    "生年": 1797,
    "卒年": 1855
  },
  {
    "姓名": "劉江水",
    "出生地": "永靖",
    "生年": 1899,
    "卒年": 1977
  },
  {
    "姓名": "劉金志",
    "出生地": "田中",
    "生年": 1936,
    "卒年": 2012
  },
  {
    "姓名": "歐陽錦華",
    "出生地": "鹿港",
    "生年": 1924,
    "卒年": 2013
  },
  {
    "姓名": "蔡相",
    "出生地": "鹿港",
    "生年": 1900,
    "卒年": 1987
  },
  {
    "姓名": "蔡催慶",
    "出生地": "彰化",
    "生年": "",
    "卒年": 1779
  },
  {
    "姓名": "蔡壽星",
    "出生地": "鹿港",
    "生年": 1857,
    "卒年": 1924
  },
  {
    "姓名": "蔡德芳",
    "出生地": "鹿港",
    "生年": 1824,
    "卒年": 1899
  },
  {
    "姓名": "蔡穀元",
    "出生地": "鹿港",
    "生年": 1853,
    "卒年": 1895
  },
  {
    "姓名": "蔡穀仁",
    "出生地": "鹿港",
    "生年": 1867,
    "卒年": 1945
  },
  {
    "姓名": "蔡德宣",
    "出生地": "鹿港",
    "生年": 1872,
    "卒年": 1944
  },
  {
    "姓名": "蔡德輝",
    "出生地": "鹿港",
    "生年": 1833,
    "卒年": 1891
  },
  {
    "姓名": "蔡麗卿",
    "出生地": "鹿港",
    "生年": 1933,
    "卒年": 2012
  },
  {
    "姓名": "鄭貽林",
    "出生地": "鹿港",
    "生年": 1859,
    "卒年": 1927
  },
  {
    "姓名": "鄭鴻猷",
    "出生地": "鹿港",
    "生年": 1856,
    "卒年": 1920
  },
  {
    "姓名": "蕭翔文",
    "出生地": "田中",
    "生年": 1927,
    "卒年": 1998
  },
  {
    "姓名": "賴木松",
    "出生地": "彰化",
    "生年": 1918,
    "卒年": 1999
  },
  {
    "姓名": "賴步雲",
    "出生地": "大村",
    "生年": 1819,
    "卒年": 1860
  },
  {
    "姓名": "賴登雲",
    "出生地": "大村",
    "生年": 1824,
    "卒年": 1887
  },
  {
    "姓名": "賴和",
    "出生地": "彰化",
    "生年": 1894,
    "卒年": 1943
  },
  {
    "姓名": "賴雲龍",
    "出生地": "大村",
    "生年": 1910,
    "卒年": 1982
  },
  {
    "姓名": "賴慶",
    "出生地": "大村",
    "生年": 1882,
    "卒年": 1958
  },
  {
    "姓名": "賴賢穎",
    "出生地": "彰化",
    "生年": 1909,
    "卒年": 1981
  },
  {
    "姓名": "賴繩武",
    "出生地": "大村",
    "生年": 1851,
    "卒年": 1916
  },
  {
    "姓名": "賴紹堯",
    "出生地": "大村",
    "生年": 1871,
    "卒年": 1917
  },
  {
    "姓名": "錦連",
    "出生地": "彰化",
    "生年": 1928,
    "卒年": 2013
  },
  {
    "姓名": "謝苗",
    "出生地": "二水",
    "生年": 1917,
    "卒年": 1998
  },
  {
    "姓名": "謝悅",
    "出生地": "芳苑",
    "生年": 1895,
    "卒年": 1990
  },
  {
    "姓名": "謝振聲",
    "出生地": "秀水",
    "生年": "",
    "卒年": 1905
  },
  {
    "姓名": "謝遵信",
    "出生地": "二水",
    "生年": 1902,
    "卒年": 1975
  },
  {
    "姓名": "魏國楨",
    "出生地": "田中",
    "生年": 1881,
    "卒年": 1940
  },
  {
    "姓名": "施九緞",
    "出生地": "埔鹽",
    "生年": 1829,
    "卒年": 1890
  },
  {
    "姓名": "施仁思",
    "出生地": "鹿港",
    "生年": 1858,
    "卒年": 1897
  },
  {
    "姓名": "施玉斗",
    "出生地": "鹿港",
    "生年": 1897,
    "卒年": 1981
  },
  {
    "姓名": "施江東",
    "出生地": "嘉義",
    "生年": 1897,
    "卒年": 1952
  },
  {
    "姓名": "施江西",
    "出生地": "臺北",
    "生年": 1899,
    "卒年": 1981
  },
  {
    "姓名": "施江南",
    "出生地": "臺北",
    "生年": 1902,
    "卒年": 1947
  },
  {
    "姓名": "施性瑟",
    "出生地": "鹿港",
    "生年": 1896,
    "卒年": 1974
  },
  {
    "姓名": "施家珍",
    "出生地": "鹿港",
    "生年": 1851,
    "卒年": 1890
  },
  {
    "姓名": "施淵舉",
    "出生地": "鹿港",
    "生年": 1803,
    "卒年": 1877
  },
  {
    "姓名": "陳士陶",
    "出生地": "鹿港",
    "生年": 1749,
    "卒年": 1826
  },
  {
    "姓名": "陳天送",
    "出生地": "秀水",
    "生年": 1885,
    "卒年": 1952
  },
  {
    "姓名": "陳火旺",
    "出生地": "田中",
    "生年": 1915,
    "卒年": 2001
  },
  {
    "姓名": "陳以波",
    "出生地": "北斗",
    "生年": 1885,
    "卒年": 1951
  },
  {
    "姓名": "陳百川",
    "出生地": "芳苑",
    "生年": 1936,
    "卒年": 1994
  },
  {
    "姓名": "陳克勸",
    "出生地": "鹿港",
    "生年": 1776,
    "卒年": 1861
  },
  {
    "姓名": "陳其意",
    "出生地": "永靖",
    "生年": 1910,
    "卒年": 1987
  },
  {
    "姓名": "陳奇灶",
    "出生地": "埔鹽",
    "生年": 1873,
    "卒年": 1951
  },
  {
    "姓名": "陳武",
    "出生地": "彰化",
    "生年": 1770,
    "卒年": 1827
  },
  {
    "姓名": "陳長庚",
    "出生地": "芬園",
    "生年": 1885,
    "卒年": ""
  },
  {
    "姓名": "陳恆仁",
    "出生地": "田中",
    "生年": 1874,
    "卒年": 1943
  },
  {
    "姓名": "陳洛書",
    "出生地": "芬園",
    "生年": 1860,
    "卒年": 1921
  },
  {
    "姓名": "陳書友",
    "出生地": "員林",
    "生年": 1923,
    "卒年": 1990
  },
  {
    "姓名": "陳帳",
    "出生地": "彰化",
    "生年": 1900,
    "卒年": 1951
  },
  {
    "姓名": "陳梓成",
    "出生地": "二林",
    "生年": 1869,
    "卒年": 1953
  },
  {
    "姓名": "陳添文",
    "出生地": "溪湖",
    "生年": 1850,
    "卒年": 1897
  },
  {
    "姓名": "陳貫世",
    "出生地": "二水",
    "生年": 1895,
    "卒年": 1976
  },
  {
    "姓名": "陳義方",
    "出生地": "永靖",
    "生年": 1827,
    "卒年": 1866
  },
  {
    "姓名": "陳萬成",
    "出生地": "溪州",
    "生年": 1921,
    "卒年": 1995
  },
  {
    "姓名": "陳萬福",
    "出生地": "溪湖",
    "生年": 1904,
    "卒年": 1968
  },
  {
    "姓名": "陳夢花",
    "出生地": "永靖",
    "生年": 1901,
    "卒年": 1977
  },
  {
    "姓名": "陳榜東",
    "出生地": "芳苑",
    "生年": 1868,
    "卒年": 1924
  },
  {
    "姓名": "陳榮華",
    "出生地": "秀水",
    "生年": 1800,
    "卒年": 1851
  },
  {
    "姓名": "陳熀村",
    "出生地": "芳苑",
    "生年": 1913,
    "卒年": 1990
  },
  {
    "姓名": "陳慶火",
    "出生地": "田尾",
    "生年": 1891,
    "卒年": 1964
  },
  {
    "姓名": "陳慶雲",
    "出生地": "永靖",
    "生年": 1878,
    "卒年": 1940
  },
  {
    "姓名": "陳錫奎",
    "出生地": "和美",
    "生年": 1874,
    "卒年": 1954
  },
  {
    "姓名": "陳鴻謨",
    "出生地": "彰化",
    "生年": 1880,
    "卒年": 1950
  },
  {
    "姓名": "陳繞",
    "出生地": "秀水",
    "生年": 1891,
    "卒年": 1945
  },
  {
    "姓名": "陳羅漢",
    "出生地": "田尾",
    "生年": 1878,
    "卒年": 1945
  },
  {
    "姓名": "彭文祥",
    "出生地": "田尾",
    "生年": 1894,
    "卒年": 1959
  },
  {
    "姓名": "曾深河",
    "出生地": "竹塘",
    "生年": 1910,
    "卒年": 1967
  },
  {
    "姓名": "曾錦",
    "出生地": "和美",
    "生年": 1879,
    "卒年": 1938
  },
  {
    "姓名": "辜濂松",
    "出生地": "臺北",
    "生年": 1933,
    "卒年": 2012
  },
  {
    "姓名": "黃大煪",
    "出生地": "臺中/彰化",
    "生年": 1914,
    "卒年": 1984
  },
  {
    "姓名": "黃仕卿",
    "出生地": "埔心",
    "生年": "",
    "卒年": ""
  },
  {
    "姓名": "黃合親",
    "出生地": "線西",
    "生年": 1896,
    "卒年": 1975
  },
  {
    "姓名": "黃旭",
    "出生地": "花壇",
    "生年": 1873,
    "卒年": 1952
  },
  {
    "姓名": "黃服",
    "出生地": "線西",
    "生年": 1908,
    "卒年": 1978
  },
  {
    "姓名": "黃知規",
    "出生地": "鹿港",
    "生年": "",
    "卒年": ""
  },
  {
    "姓名": "黃秋",
    "出生地": "鹿港",
    "生年": 1887,
    "卒年": 1959
  },
  {
    "姓名": "黃家慶",
    "出生地": "埔心",
    "生年": 1885,
    "卒年": 1937
  },
  {
    "姓名": "黃烈火",
    "出生地": "臺北",
    "生年": 1912,
    "卒年": 2010
  },
  {
    "姓名": "黃啟東",
    "出生地": "北斗",
    "生年": 1906,
    "卒年": 1963
  },
  {
    "姓名": "黃深泉",
    "出生地": "田尾",
    "生年": 1893,
    "卒年": 1967
  },
  {
    "姓名": "黃超英",
    "出生地": "埔心",
    "生年": 1818,
    "卒年": 1872
  },
  {
    "姓名": "黃毓玉",
    "出生地": "鹿港",
    "生年": 1887,
    "卒年": 1973
  },
  {
    "姓名": "黃瑞南",
    "出生地": "埤頭",
    "生年": 1925,
    "卒年": 2011
  },
  {
    "姓名": "黃達德",
    "出生地": "線西",
    "生年": 1905,
    "卒年": 1968
  },
  {
    "姓名": "黃銀漢",
    "出生地": "彰化",
    "生年": 1891,
    "卒年": 1954
  },
  {
    "姓名": "黃褒忠",
    "出生地": "埔心",
    "生年": 1896,
    "卒年": 1936
  },
  {
    "姓名": "黃興隆",
    "出生地": "臺中",
    "生年": 1901,
    "卒年": 1975
  },
  {
    "姓名": "黃龍",
    "出生地": "竹塘",
    "生年": 1865,
    "卒年": 1932
  },
  {
    "姓名": "楊世祈",
    "出生地": "溪湖",
    "生年": 1888,
    "卒年": 1972
  },
  {
    "姓名": "楊以專",
    "出生地": "彰化",
    "生年": 1890,
    "卒年": 1952
  },
  {
    "姓名": "楊永塗",
    "出生地": "溪湖",
    "生年": 1885,
    "卒年": 1961
  },
  {
    "姓名": "楊永祿",
    "出生地": "溪湖",
    "生年": 1904,
    "卒年": 1973
  },
  {
    "姓名": "楊永慶",
    "出生地": "溪湖",
    "生年": 1869,
    "卒年": 1932
  },
  {
    "姓名": "楊有為",
    "出生地": "溪湖",
    "生年": 1873,
    "卒年": 1909
  },
  {
    "姓名": "楊志申",
    "出生地": "彰化",
    "生年": "",
    "卒年": ""
  },
  {
    "姓名": "楊宗城",
    "出生地": "彰化",
    "生年": 1894,
    "卒年": 1984
  },
  {
    "姓名": "楊宗陶",
    "出生地": "員林",
    "生年": 1909,
    "卒年": 1978
  },
  {
    "姓名": "楊金豹",
    "出生地": "員林",
    "生年": 1909,
    "卒年": 1996
  },
  {
    "姓名": "楊春木",
    "出生地": "溪湖",
    "生年": 1900,
    "卒年": 1992
  },
  {
    "姓名": "楊章唱",
    "出生地": "溪湖",
    "生年": 1822,
    "卒年": 1883
  },
  {
    "姓名": "楊琴",
    "出生地": "溪湖",
    "生年": 1889,
    "卒年": 1962
  },
  {
    "姓名": "楊發",
    "出生地": "溪湖",
    "生年": 1901,
    "卒年": 1949
  },
  {
    "姓名": "楊榮華",
    "出生地": "溪湖",
    "生年": 1919,
    "卒年": 2007
  },
  {
    "姓名": "楊興",
    "出生地": "埔鹽",
    "生年": 1876,
    "卒年": 1920
  },
  {
    "姓名": "?原四三生",
    "出生地": "臺中市",
    "生年": 1899,
    "卒年": ""
  },
  {
    "姓名": "葉文軒",
    "出生地": "北斗",
    "生年": 1894,
    "卒年": 1939
  },
  {
    "姓名": "葉石添",
    "出生地": "田尾",
    "生年": 1905,
    "卒年": 1976
  },
  {
    "姓名": "葉崇富",
    "出生地": "溪州",
    "生年": 1930,
    "卒年": 2013
  },
  {
    "姓名": "詹石藏",
    "出生地": "北斗",
    "生年": 1920,
    "卒年": 2014
  },
  {
    "姓名": "詹仁華",
    "出生地": "竹塘",
    "生年": 1881,
    "卒年": 1932
  },
  {
    "姓名": "詹國",
    "出生地": "員林",
    "生年": 1903,
    "卒年": 1953
  },
  {
    "姓名": "詹強",
    "出生地": "永靖",
    "生年": 1916,
    "卒年": 1961
  },
  {
    "姓名": "劉益岳",
    "出生地": "員林",
    "生年": 1903,
    "卒年": 1976
  },
  {
    "姓名": "劉清喜",
    "出生地": "田尾",
    "生年": 1910,
    "卒年": 1981
  },
  {
    "姓名": "增澤深治",
    "出生地": "日本長野縣",
    "生年": 1878,
    "卒年": 1943
  },
  {
    "姓名": "蔡青筠",
    "出生地": "鹿港",
    "生年": 1868,
    "卒年": 1927
  },
  {
    "姓名": "蔡淇茂",
    "出生地": "員林",
    "生年": 1915,
    "卒年": 1996
  },
  {
    "姓名": "蔡敦波",
    "出生地": "鹿港",
    "生年": 1869,
    "卒年": 1930
  },
  {
    "姓名": "蔡金爐",
    "出生地": "鹿港",
    "生年": 1900,
    "卒年": 1941
  },
  {
    "姓名": "蔡鐵龍",
    "出生地": "二水",
    "生年": 1910,
    "卒年": 1976
  },
  {
    "姓名": "鄭四蚶",
    "出生地": "溪州",
    "生年": 1887,
    "卒年": 1953
  },
  {
    "姓名": "鄭岑",
    "出生地": "社頭",
    "生年": 1880,
    "卒年": 1965
  },
  {
    "姓名": "鄭煥文",
    "出生地": "二水",
    "生年": 1904,
    "卒年": 1985
  },
  {
    "姓名": "鄭德城",
    "出生地": "北斗",
    "生年": 1924,
    "卒年": 1998
  },
  {
    "姓名": "蕭汝鍊",
    "出生地": "社頭",
    "生年": 1892,
    "卒年": 1956
  },
  {
    "姓名": "蕭煥奎",
    "出生地": "社頭",
    "生年": 1900,
    "卒年": 1968
  },
  {
    "姓名": "賴庚寅",
    "出生地": "大村",
    "生年": 1890,
    "卒年": 1941
  },
  {
    "姓名": "賴披沙",
    "出生地": "大村",
    "生年": 1907,
    "卒年": 1975
  },
  {
    "姓名": "賴昌",
    "出生地": "大村",
    "生年": 1867,
    "卒年": 1939
  },
  {
    "姓名": "賴咸熙",
    "出生地": "大村",
    "生年": 1880,
    "卒年": 1931
  },
  {
    "姓名": "賴紹羲",
    "出生地": "大村",
    "生年": 1867,
    "卒年": 1935
  },
  {
    "姓名": "賴樹旺",
    "出生地": "彰化",
    "生年": 1909,
    "卒年": 1998
  },
  {
    "姓名": "薛達",
    "出生地": "田尾",
    "生年": 1886,
    "卒年": 1959
  },
  {
    "姓名": "謝仁賢",
    "出生地": "北斗",
    "生年": 1885,
    "卒年": 1963
  },
  {
    "姓名": "謝在祺",
    "出生地": "二水",
    "生年": 1886,
    "卒年": 1952
  },
  {
    "姓名": "謝屋",
    "出生地": "員林",
    "生年": 1881,
    "卒年": 1937
  },
  {
    "姓名": "謝茂臣",
    "出生地": "和美",
    "生年": 1881,
    "卒年": 1923
  },
  {
    "姓名": "謝清光",
    "出生地": "田中",
    "生年": 1879,
    "卒年": 1939
  },
  {
    "姓名": "謝蚶目",
    "出生地": "二林",
    "生年": 1891,
    "卒年": 1940
  },
  {
    "姓名": "謝媽春",
    "出生地": "員林",
    "生年": 1861,
    "卒年": 1942
  },
  {
    "姓名": "謝慶",
    "出生地": "福興",
    "生年": 1891,
    "卒年": 1981
  },
  {
    "姓名": "謝標塵",
    "出生地": "溪州",
    "生年": 1932,
    "卒年": 2007
  },
  {
    "姓名": "謝耀東",
    "出生地": "鹿港",
    "生年": 1897,
    "卒年": 1935
  },
  {
    "姓名": "顏克忠",
    "出生地": "埔鹽",
    "生年": 1901,
    "卒年": 1966
  },
  {
    "姓名": "顏見得",
    "出生地": "員林",
    "生年": 1915,
    "卒年": 1990
  },
  {
    "姓名": "魏國煌",
    "出生地": "社頭",
    "生年": 1911,
    "卒年": 1988
  },
  {
    "姓名": "魏和衷",
    "出生地": "社頭",
    "生年": 1935,
    "卒年": 2012
  },
  {
    "姓名": "魏瓊昭",
    "出生地": "永靖",
    "生年": 1845,
    "卒年": 1901
  },
  {
    "姓名": "魏明德",
    "出生地": "永靖",
    "生年": 1885,
    "卒年": 1932
  },
  {
    "姓名": "魏錫清",
    "出生地": "員林",
    "生年": 1893,
    "卒年": 1966
  },
  {
    "姓名": "羅老庚",
    "出生地": "田尾",
    "生年": 1902,
    "卒年": 1953
  }
];